{
  "text": {
    "register": 346,
    "now": 288,
    "i": 203,
    "hadi": 182,
    "cheayto": 70,
    "my": 276,
    "name": 277,
    "be": 45,
    "aya": 40,
    "ali": 19,
    "mohamad": 267,
    "you": 466,
    "can": 63,
    "call": 61,
    "fatima": 149,
    "khalil": 228,
    "full": 165,
    "jad": 221,
    "nasrallah": 279,
    "it": 219,
    "sara": 363,
    "abi": 3,
    "youne": 467,
    "elie": 127,
    "hanna": 183,
    "go": 171,
    "by": 59,
    "lina": 244,
    "rizk": 355,
    "the": 407,
    "s": 361,
    "omar": 294,
    "daher": 95,
    "akbar": 18,
    "cynthia": 93,
    "abdallah": 2,
    "ch": 66,
    "__number__": 0,
    "gmail": 170,
    "com": 75,
    "email": 129,
    "at": 33,
    "ay": 39,
    "reach": 340,
    "d": 94,
    "send": 373,
    "info": 208,
    "to": 417,
    "nasr": 278,
    "here": 188,
    "k": 226,
    "hotmail": 197,
    "h": 181,
    "usj": 435,
    "edu": 125,
    "university": 429,
    "drop": 116,
    "rizk23": 356,
    "yahoo": 464,
    "use": 434,
    "m": 252,
    "protonmail": 334,
    "for": 161,
    "school": 368,
    "mariah": 258,
    "j": 220,
    "example": 139,
    "a": 1,
    "bot": 53,
    "human": 201,
    "this": 413,
    "real": 341,
    "person": 316,
    "talk": 397,
    "chat": 67,
    "with": 458,
    "right": 354,
    "an": 23,
    "ai": 16,
    "just": 225,
    "computer": 78,
    "automate": 37,
    "chatbot": 68,
    "who": 456,
    "conversation": 82,
    "alive": 20,
    "intelligent": 212,
    "sound": 381,
    "like": 243,
    "robot": 357,
    "or": 303,
    "machine": 253,
    "think": 412,
    "re": 339,
    "honest": 195,
    "hey": 189,
    "hello": 186,
    "hi": 190,
    "there": 409,
    "good": 172,
    "morning": 272,
    "evening": 135,
    "moin": 268,
    "let": 241,
    "us": 433,
    "dude": 117,
    "goodmorning": 175,
    "goodevene": 174,
    "afternoon": 15,
    "cu": 91,
    "cee": 65,
    "later": 235,
    "night": 284,
    "bye": 60,
    "goodbye": 173,
    "have": 185,
    "nice": 283,
    "day": 98,
    "see": 371,
    "around": 29,
    "how": 200,
    "long": 249,
    "do": 113,
    "master": 259,
    "take": 396,
    "complete": 77,
    "program": 332,
    "what": 451,
    "length": 240,
    "of": 291,
    "duration": 118,
    "degree": 102,
    "year": 465,
    "many": 257,
    "month": 270,
    "last": 233,
    "one": 296,
    "total": 422,
    "time": 414,
    "need": 281,
    "finish": 154,
    "part": 310,
    "in": 206,
    "academic": 6,
    "cover": 87,
    "semester": 372,
    "divide": 111,
    "into": 217,
    "number": 289,
    "term": 403,
    "per": 313,
    "require": 351,
    "summer": 392,
    "include": 207,
    "structure": 386,
    "breakdown": 55,
    "credit": 88,
    "ect": 124,
    "load": 246,
    "requirement": 352,
    "graduation": 178,
    "minimum": 265,
    "optional": 302,
    "distribution": 110,
    "between": 49,
    "course": 86,
    "transfer": 423,
    "external": 145,
    "thesis": 410,
    "worth": 462,
    "list": 245,
    "all": 21,
    "available": 38,
    "show": 377,
    "offer": 293,
    "which": 454,
    "want": 443,
    "know": 230,
    "learning": 238,
    "tell": 402,
    "about": 4,
    "deep": 100,
    "dl": 112,
    "datum": 97,
    "mining": 266,
    "explain": 144,
    "nlp": 285,
    "interested": 213,
    "vision": 440,
    "reinforcement": 347,
    "learn": 237,
    "game": 167,
    "theory": 408,
    "teach": 398,
    "apply": 27,
    "get": 168,
    "accept": 7,
    "gpa": 176,
    "bachelor": 41,
    "cs": 90,
    "entrance": 133,
    "exam": 138,
    "work": 461,
    "experience": 142,
    "mandatory": 256,
    "document": 114,
    "should": 376,
    "submit": 389,
    "recommendation": 344,
    "letter": 242,
    "interview": 216,
    "process": 328,
    "ielt": 204,
    "toefl": 418,
    "score": 370,
    "without": 460,
    "tech": 401,
    "background": 43,
    "prerequisite": 324,
    "we": 446,
    "access": 8,
    "entry": 134,
    "qualify": 338,
    "condition": 79,
    "must": 275,
    "meet": 263,
    "join": 223,
    "enroll": 132,
    "admission": 11,
    "criterion": 89,
    "eligibility": 128,
    "application": 26,
    "qualification": 337,
    "when": 452,
    "start": 385,
    "much": 274,
    "cost": 83,
    "tuition": 425,
    "fee": 151,
    "price": 326,
    "additional": 9,
    "payment": 312,
    "plan": 321,
    "international": 214,
    "student": 387,
    "material": 260,
    "scholarship": 367,
    "discount": 108,
    "early": 121,
    "pay": 311,
    "installment": 209,
    "that": 406,
    "affordable": 13,
    "not": 287,
    "bad": 44,
    "waw": 444,
    "great": 180,
    "reasonable": 342,
    "perfect": 315,
    "thank": 405,
    "value": 438,
    "money": 269,
    "within": 459,
    "budget": 56,
    "fair": 148,
    "happy": 184,
    "oof": 299,
    "expensive": 141,
    "too": 419,
    "ouf": 306,
    "high": 191,
    "way": 445,
    "over": 308,
    "unaffordable": 427,
    "expect": 140,
    "cheap": 69,
    "afford": 12,
    "costly": 84,
    "option": 301,
    "beyond": 50,
    "mean": 262,
    "study": 388,
    "online": 297,
    "hybrid": 202,
    "remote": 349,
    "they": 411,
    "weekend": 449,
    "class": 73,
    "distance": 109,
    "while": 455,
    "after": 14,
    "hour": 198,
    "switch": 394,
    "and": 24,
    "flexibility": 157,
    "scheduling": 366,
    "only": 298,
    "on": 295,
    "campus": 62,
    "present": 325,
    "follow": 160,
    "attend": 34,
    "remotely": 350,
    "possible": 323,
    "from": 164,
    "abroad": 5,
    "home": 194,
    "format": 162,
    "move": 273,
    "lecture": 239,
    "job": 222,
    "design": 105,
    "professional": 329,
    "some": 380,
    "other": 305,
    "relocate": 348,
    "synchronous": 395,
    "asynchronous": 32,
    "support": 393,
    "flexible": 158,
    "internship": 215,
    "where": 453,
    "help": 187,
    "find": 153,
    "kind": 229,
    "unpaid": 430,
    "choose": 71,
    "company": 76,
    "language": 232,
    "english": 131,
    "french": 163,
    "if": 205,
    "speak": 383,
    "bilingual": 52,
    "write": 463,
    "primary": 327,
    "deadline": 99,
    "date": 96,
    "close": 74,
    "will": 457,
    "result": 353,
    "late": 234,
    "rolling": 359,
    "next": 282,
    "intake": 211,
    "defer": 101,
    "weekly": 450,
    "schedule": 365,
    "weekday": 448,
    "week": 447,
    "timetable": 415,
    "record": 345,
    "view": 439,
    "attendance": 35,
    "each": 120,
    "lab": 231,
    "session": 375,
    "usually": 436,
    "first": 155,
    "begin": 47,
    "pm": 322,
    "typical": 426,
    "end": 130,
    "lunch": 251,
    "break": 54,
    "back": 42,
    "hold": 193,
    "same": 362,
    "as": 30,
    "look": 250,
    "timing": 416,
    "could": 85,
    "organize": 304,
    "place": 320,
    "fix": 156,
    "ask_about_summer": 31,
    "give": 169,
    "detail": 106,
    "locate": 247,
    "city": 72,
    "urban": 432,
    "rural": 360,
    "area": 28,
    "housing": 199,
    "near": 280,
    "easy": 123,
    "public": 336,
    "transport": 424,
    "facility": 146,
    "visit": 441,
    "before": 46,
    "exactly": 137,
    "host": 196,
    "main": 254,
    "downtown": 115,
    "north": 286,
    "south": 382,
    "more": 271,
    "than": 404,
    "location": 248,
    "physically": 318,
    "science": 369,
    "satellite": 364,
    "different": 107,
    "address": 10,
    "teaching": 400,
    "build": 57,
    "building": 58,
    "shuttle": 378,
    "service": 374,
    "summary": 391,
    "overview": 309,
    "describe": 104,
    "summarize": 390,
    "curriculum": 92,
    "make": 255,
    "special": 384,
    "key": 227,
    "feature": 150,
    "highlight": 192,
    "focus": 159,
    "topic": 421,
    "education": 126,
    "unique": 428,
    "objective": 290,
    "skill": 379,
    "gain": 166,
    "big": 51,
    "picture": 319,
    "outcome": 307,
    "philosophy": 317,
    "content": 80,
    "provide": 335,
    "everything": 136,
    "up": 431,
    "financial": 152,
    "aid": 17,
    "off": 292,
    "maximum": 261,
    "percent": 314,
    "grant": 179,
    "amount": 22,
    "receive": 343,
    "waiver": 442,
    "top": 420,
    "benefit": 48,
    "instructor": 210,
    "professor": 331,
    "involve": 218,
    "faculty": 147,
    "member": 264,
    "teacher": 399,
    "lead": 236,
    "expert": 143,
    "deliver": 103,
    "during": 119,
    "any": 25,
    "vacation": 437,
    "continue": 81,
    "july": 224,
    "august": 36,
    "opportunity": 300,
    "graduate": 177,
    "career": 64,
    "easily": 122,
    "role": 358,
    "professionally": 330,
    "prospect": 333
  },
  "intent": {
    "register_now": 24,
    "inform": 21,
    "bot_challenge": 18,
    "greet": 20,
    "goodbye": 19,
    "ask_duration": 8,
    "ask_semesters": 17,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 23,
    "negative_reaction": 22,
    "ask_program_format": 15,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 16,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_format": 30,
    "utter_ask_program_summary": 31,
    "utter_ask_semesters": 32,
    "utter_goodbye": 33,
    "utter_greet": 34,
    "utter_happy_response": 35,
    "utter_iamabot": 36
  },
  "action_text": null,
  "intent_response_key": null
}