{
  "text": {
    "be": 34,
    "you": 379,
    "a": 1,
    "bot": 41,
    "human": 159,
    "this": 334,
    "real": 270,
    "person": 251,
    "i": 161,
    "talk": 319,
    "to": 337,
    "chat": 53,
    "with": 372,
    "right": 282,
    "an": 17,
    "ai": 14,
    "just": 177,
    "computer": 62,
    "automate": 28,
    "chatbot": 54,
    "who": 370,
    "conversation": 65,
    "alive": 15,
    "intelligent": 168,
    "sound": 303,
    "like": 192,
    "robot": 283,
    "or": 240,
    "machine": 200,
    "think": 333,
    "re": 269,
    "honest": 154,
    "hey": 148,
    "hello": 146,
    "hi": 149,
    "there": 330,
    "good": 137,
    "morning": 215,
    "evening": 107,
    "moin": 211,
    "let": 190,
    "us": 351,
    "go": 136,
    "dude": 94,
    "goodmorning": 140,
    "goodevene": 139,
    "afternoon": 13,
    "cu": 73,
    "by": 48,
    "cee": 52,
    "later": 185,
    "night": 224,
    "bye": 49,
    "goodbye": 138,
    "have": 145,
    "nice": 223,
    "day": 77,
    "see": 294,
    "around": 22,
    "how": 158,
    "long": 197,
    "do": 91,
    "the": 328,
    "master": 205,
    "s": 286,
    "take": 318,
    "complete": 61,
    "program": 264,
    "what": 365,
    "length": 189,
    "of": 231,
    "duration": 95,
    "degree": 81,
    "__number__": 0,
    "year": 378,
    "many": 204,
    "month": 213,
    "last": 183,
    "one": 234,
    "total": 341,
    "time": 335,
    "need": 221,
    "finish": 121,
    "full": 131,
    "part": 246,
    "can": 51,
    "it": 174,
    "in": 164,
    "academic": 4,
    "cover": 69,
    "semester": 295,
    "divide": 89,
    "into": 173,
    "number": 229,
    "term": 324,
    "per": 249,
    "require": 279,
    "summer": 314,
    "include": 165,
    "structure": 308,
    "breakdown": 43,
    "credit": 70,
    "ect": 99,
    "load": 194,
    "requirement": 280,
    "for": 127,
    "graduation": 142,
    "minimum": 209,
    "optional": 239,
    "distribution": 88,
    "between": 37,
    "course": 68,
    "transfer": 342,
    "external": 115,
    "thesis": 331,
    "worth": 376,
    "list": 193,
    "all": 16,
    "available": 29,
    "show": 299,
    "offer": 232,
    "which": 368,
    "want": 357,
    "know": 180,
    "learning": 187,
    "tell": 323,
    "about": 2,
    "deep": 79,
    "dl": 90,
    "datum": 76,
    "mining": 210,
    "explain": 114,
    "nlp": 225,
    "m": 199,
    "interested": 169,
    "vision": 355,
    "reinforcement": 275,
    "learn": 186,
    "game": 133,
    "theory": 329,
    "teach": 320,
    "apply": 20,
    "get": 134,
    "accept": 5,
    "gpa": 141,
    "bachelor": 30,
    "cs": 72,
    "entrance": 105,
    "exam": 110,
    "work": 375,
    "experience": 113,
    "mandatory": 203,
    "document": 92,
    "should": 298,
    "submit": 311,
    "recommendation": 272,
    "letter": 191,
    "interview": 172,
    "process": 262,
    "ielt": 162,
    "toefl": 338,
    "score": 293,
    "without": 374,
    "tech": 322,
    "background": 32,
    "prerequisite": 258,
    "we": 360,
    "access": 6,
    "entry": 106,
    "qualify": 268,
    "condition": 63,
    "must": 218,
    "meet": 208,
    "join": 176,
    "enroll": 104,
    "admission": 9,
    "criterion": 71,
    "eligibility": 101,
    "application": 19,
    "qualification": 267,
    "when": 366,
    "start": 307,
    "much": 217,
    "cost": 66,
    "tuition": 344,
    "fee": 119,
    "price": 260,
    "additional": 7,
    "payment": 248,
    "plan": 255,
    "international": 170,
    "student": 309,
    "material": 206,
    "scholarship": 291,
    "discount": 86,
    "early": 97,
    "pay": 247,
    "installment": 166,
    "that": 327,
    "affordable": 11,
    "not": 227,
    "bad": 33,
    "waw": 358,
    "great": 143,
    "reasonable": 271,
    "perfect": 250,
    "thank": 326,
    "value": 353,
    "money": 212,
    "within": 373,
    "my": 219,
    "budget": 45,
    "fair": 117,
    "at": 25,
    "happy": 144,
    "oof": 237,
    "expensive": 112,
    "too": 339,
    "ouf": 242,
    "high": 150,
    "way": 359,
    "over": 244,
    "unaffordable": 346,
    "expect": 111,
    "cheap": 55,
    "afford": 10,
    "costly": 67,
    "option": 238,
    "beyond": 38,
    "mean": 207,
    "study": 310,
    "online": 235,
    "hybrid": 160,
    "remote": 277,
    "they": 332,
    "weekend": 363,
    "class": 58,
    "distance": 87,
    "while": 369,
    "after": 12,
    "hour": 156,
    "switch": 316,
    "and": 18,
    "flexibility": 123,
    "scheduling": 290,
    "only": 236,
    "on": 233,
    "campus": 50,
    "present": 259,
    "follow": 126,
    "attend": 26,
    "remotely": 278,
    "possible": 257,
    "from": 130,
    "abroad": 3,
    "home": 153,
    "format": 128,
    "move": 216,
    "lecture": 188,
    "job": 175,
    "design": 83,
    "professional": 263,
    "some": 302,
    "other": 241,
    "relocate": 276,
    "synchronous": 317,
    "asynchronous": 24,
    "support": 315,
    "flexible": 124,
    "internship": 171,
    "where": 367,
    "university": 348,
    "help": 147,
    "find": 120,
    "kind": 179,
    "unpaid": 349,
    "choose": 56,
    "company": 60,
    "language": 182,
    "english": 103,
    "french": 129,
    "if": 163,
    "speak": 305,
    "bilingual": 40,
    "write": 377,
    "primary": 261,
    "deadline": 78,
    "date": 75,
    "close": 59,
    "will": 371,
    "result": 281,
    "late": 184,
    "rolling": 284,
    "next": 222,
    "intake": 167,
    "defer": 80,
    "weekly": 364,
    "schedule": 289,
    "weekday": 362,
    "week": 361,
    "timetable": 336,
    "record": 273,
    "view": 354,
    "attendance": 27,
    "each": 96,
    "lab": 181,
    "session": 297,
    "usually": 352,
    "first": 122,
    "begin": 36,
    "pm": 256,
    "typical": 345,
    "end": 102,
    "lunch": 198,
    "break": 42,
    "back": 31,
    "hold": 152,
    "same": 287,
    "as": 23,
    "locate": 195,
    "city": 57,
    "urban": 350,
    "rural": 285,
    "area": 21,
    "housing": 157,
    "near": 220,
    "easy": 98,
    "public": 266,
    "transport": 343,
    "facility": 116,
    "visit": 356,
    "before": 35,
    "exactly": 109,
    "host": 155,
    "main": 201,
    "downtown": 93,
    "north": 226,
    "south": 304,
    "more": 214,
    "than": 325,
    "location": 196,
    "physically": 253,
    "science": 292,
    "satellite": 288,
    "different": 85,
    "address": 8,
    "teaching": 321,
    "build": 46,
    "building": 47,
    "shuttle": 300,
    "service": 296,
    "give": 135,
    "summary": 313,
    "overview": 245,
    "describe": 82,
    "summarize": 312,
    "curriculum": 74,
    "make": 202,
    "special": 306,
    "key": 178,
    "feature": 118,
    "highlight": 151,
    "focus": 125,
    "topic": 340,
    "education": 100,
    "unique": 347,
    "brief": 44,
    "objective": 230,
    "skill": 301,
    "gain": 132,
    "big": 39,
    "picture": 254,
    "outcome": 243,
    "philosophy": 252,
    "detail": 84,
    "content": 64,
    "provide": 265,
    "everything": 108,
    "register": 274,
    "now": 228
  },
  "intent": {
    "bot_challenge": 14,
    "greet": 16,
    "goodbye": 15,
    "ask_duration": 7,
    "ask_semesters": 13,
    "ask_credits": 6,
    "ask_courses": 5,
    "ask_course_details": 4,
    "ask_admission": 0,
    "ask_price": 10,
    "positive_reaction": 19,
    "negative_reaction": 17,
    "ask_program_format": 11,
    "ask_internship": 8,
    "ask_language_of_instruction": 9,
    "ask_application_deadlines": 1,
    "ask_class_schedule": 3,
    "ask_campus_location": 2,
    "ask_program_summary": 12,
    "register_now": 21,
    "register": 20,
    "now": 18
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 10,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 11,
    "action_unlikely_intent": 12,
    "action_back": 0,
    "action_extract_slots": 6,
    "action_course_details": 1,
    "admission_interest_form": 13,
    "utter_aid_info": 14,
    "utter_ask_admission": 15,
    "utter_ask_application_deadlines": 16,
    "utter_ask_campus_location": 17,
    "utter_ask_class_schedule": 18,
    "utter_ask_courses": 19,
    "utter_ask_credits": 20,
    "utter_ask_duration": 21,
    "utter_ask_internship": 22,
    "utter_ask_language_of_instruction": 23,
    "utter_ask_price": 24,
    "utter_ask_program_format": 25,
    "utter_ask_program_summary": 26,
    "utter_ask_semesters": 27,
    "utter_goodbye": 28,
    "utter_greet": 29,
    "utter_happy_response": 30,
    "utter_iamabot": 31,
    "utter_submit_registration_form": 32
  },
  "action_text": null,
  "intent_response_key": null
}