{
  "text": {
    "register": 347,
    "now": 287,
    "i": 202,
    "hadi": 181,
    "cheayto": 69,
    "my": 275,
    "name": 276,
    "be": 44,
    "aya": 39,
    "ali": 19,
    "mohamad": 266,
    "you": 468,
    "can": 62,
    "call": 60,
    "fatima": 149,
    "khalil": 227,
    "full": 164,
    "jad": 220,
    "nasrallah": 278,
    "it": 218,
    "sara": 364,
    "abi": 3,
    "youne": 469,
    "elie": 126,
    "hanna": 182,
    "go": 170,
    "by": 58,
    "lina": 243,
    "rizk": 356,
    "the": 409,
    "s": 362,
    "omar": 293,
    "daher": 94,
    "akbar": 18,
    "cynthia": 92,
    "abdallah": 2,
    "ch": 65,
    "__number__": 0,
    "gmail": 169,
    "com": 74,
    "email": 128,
    "at": 32,
    "ay": 38,
    "reach": 341,
    "d": 93,
    "send": 374,
    "info": 207,
    "to": 419,
    "nasr": 277,
    "here": 187,
    "k": 225,
    "hotmail": 196,
    "h": 180,
    "usj": 437,
    "edu": 124,
    "university": 431,
    "drop": 115,
    "rizk23": 357,
    "yahoo": 466,
    "use": 436,
    "m": 251,
    "protonmail": 335,
    "for": 160,
    "school": 369,
    "mariah": 257,
    "j": 219,
    "example": 139,
    "a": 1,
    "bot": 52,
    "human": 200,
    "this": 415,
    "real": 342,
    "person": 317,
    "talk": 399,
    "chat": 66,
    "with": 460,
    "right": 355,
    "an": 23,
    "ai": 16,
    "just": 224,
    "computer": 77,
    "automate": 36,
    "chatbot": 67,
    "who": 458,
    "conversation": 81,
    "alive": 20,
    "intelligent": 211,
    "sound": 383,
    "like": 242,
    "robot": 358,
    "or": 302,
    "machine": 252,
    "think": 414,
    "re": 340,
    "honest": 194,
    "hey": 188,
    "hello": 185,
    "hi": 189,
    "there": 411,
    "good": 171,
    "morning": 271,
    "evening": 135,
    "moin": 267,
    "let": 240,
    "us": 435,
    "dude": 116,
    "goodmorning": 174,
    "goodevene": 173,
    "afternoon": 15,
    "cu": 90,
    "cee": 64,
    "later": 234,
    "night": 283,
    "bye": 59,
    "goodbye": 172,
    "have": 184,
    "nice": 282,
    "day": 97,
    "see": 372,
    "around": 29,
    "how": 199,
    "long": 248,
    "do": 112,
    "master": 258,
    "take": 398,
    "complete": 76,
    "program": 333,
    "what": 453,
    "length": 239,
    "of": 290,
    "duration": 117,
    "degree": 101,
    "year": 467,
    "many": 256,
    "month": 269,
    "last": 232,
    "one": 295,
    "total": 424,
    "time": 416,
    "need": 280,
    "finish": 154,
    "part": 310,
    "in": 205,
    "academic": 6,
    "cover": 86,
    "semester": 373,
    "divide": 110,
    "into": 216,
    "number": 288,
    "term": 405,
    "per": 313,
    "require": 352,
    "structure": 388,
    "breakdown": 54,
    "credit": 87,
    "ect": 123,
    "load": 245,
    "requirement": 353,
    "graduation": 177,
    "minimum": 264,
    "optional": 301,
    "distribution": 109,
    "between": 48,
    "course": 85,
    "transfer": 425,
    "external": 145,
    "thesis": 412,
    "worth": 464,
    "include": 206,
    "list": 244,
    "all": 21,
    "available": 37,
    "show": 378,
    "offer": 292,
    "which": 456,
    "want": 445,
    "know": 229,
    "learning": 237,
    "tell": 404,
    "about": 4,
    "deep": 99,
    "dl": 111,
    "datum": 96,
    "mining": 265,
    "explain": 144,
    "nlp": 284,
    "interested": 212,
    "vision": 442,
    "reinforcement": 348,
    "learn": 236,
    "game": 166,
    "theory": 410,
    "teach": 400,
    "apply": 27,
    "get": 167,
    "accept": 7,
    "gpa": 175,
    "bachelor": 40,
    "cs": 89,
    "entrance": 133,
    "exam": 138,
    "work": 463,
    "experience": 142,
    "mandatory": 255,
    "document": 113,
    "should": 377,
    "submit": 391,
    "recommendation": 345,
    "letter": 241,
    "interview": 215,
    "process": 329,
    "ielt": 203,
    "toefl": 420,
    "score": 371,
    "without": 462,
    "tech": 403,
    "background": 42,
    "prerequisite": 325,
    "we": 448,
    "access": 8,
    "entry": 134,
    "qualify": 339,
    "condition": 78,
    "must": 274,
    "meet": 262,
    "join": 222,
    "enroll": 131,
    "admission": 11,
    "criterion": 88,
    "eligibility": 127,
    "application": 26,
    "qualification": 338,
    "when": 454,
    "start": 387,
    "any": 25,
    "enter": 132,
    "much": 273,
    "cost": 82,
    "tuition": 427,
    "fee": 151,
    "price": 327,
    "additional": 9,
    "payment": 312,
    "plan": 322,
    "international": 213,
    "student": 389,
    "material": 259,
    "scholarship": 368,
    "discount": 107,
    "early": 120,
    "pay": 311,
    "installment": 208,
    "that": 408,
    "affordable": 13,
    "not": 286,
    "bad": 43,
    "waw": 446,
    "great": 179,
    "reasonable": 343,
    "perfect": 316,
    "thank": 407,
    "value": 440,
    "money": 268,
    "within": 461,
    "budget": 55,
    "fair": 148,
    "happy": 183,
    "oof": 298,
    "expensive": 141,
    "too": 421,
    "ouf": 305,
    "high": 190,
    "way": 447,
    "over": 307,
    "unaffordable": 429,
    "expect": 140,
    "cheap": 68,
    "afford": 12,
    "costly": 83,
    "option": 300,
    "beyond": 49,
    "mean": 261,
    "study": 390,
    "online": 296,
    "hybrid": 201,
    "remote": 350,
    "they": 413,
    "weekend": 451,
    "class": 72,
    "distance": 108,
    "while": 457,
    "after": 14,
    "hour": 197,
    "switch": 396,
    "and": 24,
    "flexibility": 156,
    "scheduling": 367,
    "only": 297,
    "on": 294,
    "campus": 61,
    "present": 326,
    "follow": 159,
    "attend": 33,
    "remotely": 351,
    "possible": 324,
    "from": 163,
    "abroad": 5,
    "home": 193,
    "format": 161,
    "move": 272,
    "lecture": 238,
    "job": 221,
    "design": 104,
    "professional": 330,
    "some": 382,
    "other": 304,
    "relocate": 349,
    "synchronous": 397,
    "asynchronous": 31,
    "support": 395,
    "flexible": 157,
    "internship": 214,
    "where": 455,
    "help": 186,
    "find": 153,
    "kind": 228,
    "unpaid": 432,
    "choose": 70,
    "company": 75,
    "language": 231,
    "english": 130,
    "french": 162,
    "if": 204,
    "speak": 385,
    "bilingual": 51,
    "write": 465,
    "primary": 328,
    "deadline": 98,
    "date": 95,
    "close": 73,
    "will": 459,
    "result": 354,
    "late": 233,
    "rolling": 360,
    "next": 281,
    "intake": 210,
    "defer": 100,
    "weekly": 452,
    "schedule": 366,
    "weekday": 450,
    "week": 449,
    "timetable": 417,
    "record": 346,
    "view": 441,
    "attendance": 34,
    "each": 119,
    "lab": 230,
    "session": 376,
    "usually": 438,
    "first": 155,
    "begin": 46,
    "pm": 323,
    "typical": 428,
    "end": 129,
    "lunch": 250,
    "break": 53,
    "back": 41,
    "hold": 192,
    "same": 363,
    "as": 30,
    "look": 249,
    "timing": 418,
    "could": 84,
    "organize": 303,
    "place": 321,
    "give": 168,
    "detail": 105,
    "locate": 246,
    "city": 71,
    "urban": 434,
    "rural": 361,
    "area": 28,
    "housing": 198,
    "near": 279,
    "easy": 122,
    "public": 337,
    "transport": 426,
    "facility": 146,
    "visit": 443,
    "before": 45,
    "exactly": 137,
    "host": 195,
    "main": 253,
    "downtown": 114,
    "north": 285,
    "south": 384,
    "more": 270,
    "than": 406,
    "location": 247,
    "physically": 319,
    "science": 370,
    "satellite": 365,
    "different": 106,
    "address": 10,
    "teaching": 402,
    "build": 56,
    "building": 57,
    "shuttle": 379,
    "service": 375,
    "summary": 393,
    "overview": 308,
    "describe": 103,
    "summarize": 392,
    "curriculum": 91,
    "make": 254,
    "special": 386,
    "key": 226,
    "feature": 150,
    "highlight": 191,
    "focus": 158,
    "topic": 423,
    "education": 125,
    "unique": 430,
    "objective": 289,
    "skill": 380,
    "gain": 165,
    "big": 50,
    "picture": 320,
    "outcome": 306,
    "philosophy": 318,
    "content": 79,
    "provide": 336,
    "everything": 136,
    "up": 433,
    "financial": 152,
    "aid": 17,
    "off": 291,
    "maximum": 260,
    "percent": 314,
    "grant": 178,
    "amount": 22,
    "receive": 344,
    "waiver": 444,
    "top": 422,
    "benefit": 47,
    "percentage": 315,
    "package": 309,
    "social": 381,
    "instructor": 209,
    "professor": 332,
    "involve": 217,
    "faculty": 147,
    "member": 263,
    "teacher": 401,
    "lead": 235,
    "expert": 143,
    "deliver": 102,
    "summer": 394,
    "during": 118,
    "vacation": 439,
    "continue": 80,
    "july": 223,
    "august": 35,
    "opportunity": 299,
    "graduate": 176,
    "career": 63,
    "easily": 121,
    "role": 359,
    "professionally": 331,
    "prospect": 334
  },
  "intent": {
    "register_now": 24,
    "inform": 21,
    "bot_challenge": 18,
    "greet": 20,
    "goodbye": 19,
    "ask_duration": 8,
    "ask_semesters": 17,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 23,
    "negative_reaction": 22,
    "ask_program_format": 15,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 16,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_format": 30,
    "utter_ask_program_summary": 31,
    "utter_ask_semesters": 32,
    "utter_goodbye": 33,
    "utter_greet": 34,
    "utter_happy_response": 35,
    "utter_iamabot": 36
  },
  "action_text": null,
  "intent_response_key": null
}