{
  "text": {
    "register": 342,
    "now": 285,
    "i": 197,
    "hadi": 178,
    "cheayto": 69,
    "my": 272,
    "name": 274,
    "be": 43,
    "aya": 38,
    "ali": 19,
    "mohamad": 264,
    "you": 456,
    "can": 62,
    "call": 60,
    "fatima": 148,
    "khalil": 223,
    "full": 161,
    "jad": 215,
    "nasrallah": 276,
    "it": 213,
    "sara": 357,
    "abi": 3,
    "youne": 457,
    "elie": 125,
    "hanna": 179,
    "go": 167,
    "by": 57,
    "lina": 240,
    "rizk": 348,
    "the": 398,
    "s": 354,
    "omar": 291,
    "daher": 95,
    "akbar": 18,
    "cynthia": 93,
    "abdallah": 2,
    "ch": 65,
    "__number__": 0,
    "gmail": 166,
    "com": 74,
    "email": 127,
    "at": 31,
    "ay": 37,
    "reach": 336,
    "d": 94,
    "send": 366,
    "info": 202,
    "to": 408,
    "nasr": 275,
    "here": 184,
    "k": 221,
    "hotmail": 192,
    "h": 177,
    "usj": 426,
    "edu": 123,
    "university": 420,
    "drop": 114,
    "rizk23": 349,
    "yahoo": 454,
    "use": 425,
    "m": 248,
    "protonmail": 330,
    "for": 158,
    "school": 361,
    "mariah": 254,
    "j": 214,
    "example": 138,
    "jean": 216,
    "pierre": 317,
    "salim": 355,
    "marianne": 255,
    "nader": 273,
    "a": 1,
    "bot": 51,
    "human": 196,
    "this": 404,
    "real": 337,
    "person": 313,
    "talk": 388,
    "chat": 66,
    "with": 448,
    "right": 347,
    "an": 23,
    "ai": 16,
    "just": 220,
    "computer": 77,
    "automate": 35,
    "chatbot": 67,
    "who": 446,
    "conversation": 81,
    "alive": 20,
    "intelligent": 206,
    "sound": 374,
    "like": 239,
    "robot": 350,
    "or": 299,
    "machine": 249,
    "think": 403,
    "re": 335,
    "honest": 190,
    "hey": 185,
    "hello": 182,
    "hi": 186,
    "there": 401,
    "good": 168,
    "morning": 269,
    "evening": 134,
    "moin": 265,
    "let": 237,
    "us": 424,
    "dude": 115,
    "goodmorning": 171,
    "goodevene": 170,
    "afternoon": 15,
    "cu": 91,
    "cee": 64,
    "later": 231,
    "night": 281,
    "bye": 58,
    "goodbye": 169,
    "have": 181,
    "nice": 280,
    "day": 98,
    "see": 364,
    "around": 29,
    "how": 195,
    "long": 245,
    "do": 111,
    "master": 256,
    "take": 387,
    "complete": 76,
    "program": 328,
    "what": 442,
    "length": 236,
    "of": 288,
    "duration": 116,
    "degree": 102,
    "year": 455,
    "many": 253,
    "month": 267,
    "last": 229,
    "one": 293,
    "total": 413,
    "time": 405,
    "need": 278,
    "finish": 153,
    "part": 306,
    "in": 200,
    "academic": 6,
    "cover": 87,
    "about": 4,
    "semester": 365,
    "divide": 109,
    "into": 211,
    "number": 286,
    "term": 394,
    "per": 309,
    "require": 344,
    "structure": 379,
    "breakdown": 53,
    "each": 118,
    "credit": 88,
    "ect": 122,
    "load": 242,
    "requirement": 345,
    "graduation": 174,
    "minimum": 262,
    "optional": 298,
    "distribution": 108,
    "between": 47,
    "course": 86,
    "transfer": 414,
    "external": 144,
    "thesis": 402,
    "worth": 452,
    "include": 201,
    "list": 241,
    "all": 21,
    "available": 36,
    "show": 370,
    "offer": 290,
    "which": 445,
    "want": 434,
    "know": 225,
    "learning": 234,
    "tell": 393,
    "deep": 100,
    "dl": 110,
    "datum": 97,
    "mining": 263,
    "explain": 143,
    "nlp": 282,
    "interested": 207,
    "vision": 431,
    "reinforcement": 343,
    "learn": 233,
    "game": 163,
    "theory": 400,
    "teach": 389,
    "apply": 27,
    "get": 164,
    "accept": 7,
    "gpa": 172,
    "bachelor": 39,
    "cs": 90,
    "entrance": 132,
    "exam": 137,
    "work": 451,
    "experience": 141,
    "mandatory": 252,
    "document": 112,
    "should": 369,
    "submit": 382,
    "recommendation": 340,
    "letter": 238,
    "interview": 210,
    "process": 325,
    "ielt": 198,
    "toefl": 409,
    "score": 363,
    "without": 450,
    "tech": 392,
    "background": 41,
    "prerequisite": 322,
    "we": 437,
    "access": 8,
    "entry": 133,
    "qualify": 334,
    "condition": 78,
    "must": 271,
    "meet": 260,
    "join": 218,
    "enroll": 130,
    "admission": 11,
    "criterion": 89,
    "eligibility": 126,
    "application": 26,
    "qualification": 333,
    "when": 443,
    "start": 378,
    "any": 25,
    "enter": 131,
    "much": 270,
    "cost": 83,
    "tuition": 416,
    "fee": 150,
    "price": 323,
    "additional": 9,
    "payment": 308,
    "plan": 319,
    "international": 208,
    "student": 380,
    "material": 257,
    "scholarship": 360,
    "discount": 107,
    "early": 119,
    "pay": 307,
    "installment": 203,
    "that": 397,
    "cool": 82,
    "affordable": 13,
    "not": 284,
    "bad": 42,
    "waw": 435,
    "great": 176,
    "reasonable": 338,
    "perfect": 312,
    "thank": 396,
    "value": 429,
    "money": 266,
    "within": 449,
    "budget": 54,
    "fair": 147,
    "happy": 180,
    "oof": 295,
    "expensive": 140,
    "too": 410,
    "ouf": 301,
    "high": 187,
    "way": 436,
    "over": 303,
    "unaffordable": 418,
    "expect": 139,
    "cheap": 68,
    "afford": 12,
    "costly": 84,
    "option": 297,
    "beyond": 48,
    "mean": 259,
    "internship": 209,
    "where": 444,
    "help": 183,
    "find": 152,
    "kind": 224,
    "abroad": 5,
    "unpaid": 421,
    "choose": 70,
    "company": 75,
    "language": 228,
    "english": 129,
    "french": 159,
    "study": 381,
    "if": 199,
    "speak": 376,
    "class": 72,
    "bilingual": 50,
    "write": 453,
    "support": 386,
    "attend": 32,
    "only": 294,
    "primary": 324,
    "laguage": 227,
    "deadline": 99,
    "date": 96,
    "after": 14,
    "close": 73,
    "will": 447,
    "result": 346,
    "late": 230,
    "rolling": 352,
    "next": 279,
    "intake": 205,
    "defer": 101,
    "weekly": 441,
    "schedule": 359,
    "on": 292,
    "weekday": 439,
    "weekend": 440,
    "hour": 193,
    "week": 438,
    "timetable": 406,
    "record": 341,
    "view": 430,
    "attendance": 33,
    "lab": 226,
    "session": 368,
    "lecture": 235,
    "flexible": 155,
    "usually": 427,
    "first": 154,
    "begin": 45,
    "pm": 320,
    "typical": 417,
    "end": 128,
    "lunch": 247,
    "break": 52,
    "back": 40,
    "hold": 189,
    "same": 356,
    "as": 30,
    "look": 246,
    "timing": 407,
    "could": 85,
    "organize": 300,
    "place": 318,
    "give": 165,
    "detail": 105,
    "calender": 59,
    "locate": 243,
    "city": 71,
    "campus": 61,
    "urban": 423,
    "rural": 353,
    "area": 28,
    "housing": 194,
    "near": 277,
    "easy": 121,
    "public": 332,
    "transport": 415,
    "facility": 145,
    "visit": 432,
    "before": 44,
    "exactly": 136,
    "host": 191,
    "main": 250,
    "downtown": 113,
    "north": 283,
    "south": 375,
    "more": 268,
    "than": 395,
    "location": 244,
    "physically": 315,
    "science": 362,
    "satellite": 358,
    "different": 106,
    "address": 10,
    "teaching": 391,
    "build": 55,
    "building": 56,
    "shuttle": 371,
    "service": 367,
    "summary": 384,
    "overview": 304,
    "describe": 104,
    "summarize": 383,
    "curriculum": 92,
    "make": 251,
    "special": 377,
    "key": 222,
    "feature": 149,
    "highlight": 188,
    "focus": 156,
    "topic": 412,
    "education": 124,
    "unique": 419,
    "objective": 287,
    "skill": 372,
    "gain": 162,
    "big": 49,
    "picture": 316,
    "outcome": 302,
    "philosophy": 314,
    "content": 79,
    "provide": 331,
    "everything": 135,
    "up": 422,
    "possible": 321,
    "financial": 151,
    "aid": 17,
    "off": 289,
    "maximum": 258,
    "percent": 310,
    "grant": 175,
    "amount": 22,
    "receive": 339,
    "waiver": 433,
    "top": 411,
    "benefit": 46,
    "from": 160,
    "percentage": 311,
    "package": 305,
    "social": 373,
    "instructor": 204,
    "professor": 327,
    "involve": 212,
    "faculty": 146,
    "member": 261,
    "teacher": 390,
    "lead": 232,
    "expert": 142,
    "deliver": 103,
    "summer": 385,
    "during": 117,
    "vacation": 428,
    "continue": 80,
    "july": 219,
    "and": 24,
    "august": 34,
    "job": 217,
    "opportunity": 296,
    "graduate": 173,
    "career": 63,
    "follow": 157,
    "easily": 120,
    "role": 351,
    "professionally": 326,
    "prospect": 329,
    "then": 399
  },
  "intent": {
    "register_now": 23,
    "inform": 20,
    "bot_challenge": 17,
    "greet": 19,
    "goodbye": 18,
    "ask_duration": 8,
    "ask_semesters": 16,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 22,
    "negative_reaction": 21,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 15,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_summary": 30,
    "utter_ask_semesters": 31,
    "utter_goodbye": 32,
    "utter_greet": 33,
    "utter_happy_response": 34,
    "utter_iamabot": 35
  },
  "action_text": null,
  "intent_response_key": null
}