{
  "text": {
    "register": 281,
    "now": 235,
    "hadi": 149,
    "cheayto": 57,
    "my": 225,
    "name": 226,
    "be": 34,
    "ch": 53,
    "__number__": 0,
    "gmail": 140,
    "com": 62,
    "email": 105,
    "you": 386,
    "a": 1,
    "bot": 41,
    "human": 165,
    "this": 341,
    "real": 277,
    "person": 258,
    "i": 167,
    "talk": 326,
    "to": 344,
    "chat": 54,
    "with": 379,
    "right": 289,
    "an": 17,
    "ai": 14,
    "just": 183,
    "computer": 65,
    "automate": 28,
    "chatbot": 55,
    "who": 377,
    "conversation": 68,
    "alive": 15,
    "intelligent": 174,
    "sound": 310,
    "like": 198,
    "robot": 290,
    "or": 247,
    "machine": 206,
    "think": 340,
    "re": 276,
    "honest": 160,
    "hey": 154,
    "hello": 152,
    "hi": 155,
    "there": 337,
    "good": 142,
    "morning": 221,
    "evening": 111,
    "moin": 217,
    "let": 196,
    "us": 358,
    "go": 141,
    "dude": 97,
    "goodmorning": 145,
    "goodevene": 144,
    "afternoon": 13,
    "cu": 76,
    "by": 48,
    "cee": 52,
    "later": 191,
    "night": 231,
    "bye": 49,
    "goodbye": 143,
    "have": 151,
    "nice": 230,
    "day": 80,
    "see": 301,
    "around": 22,
    "how": 164,
    "long": 203,
    "do": 94,
    "the": 335,
    "master": 211,
    "s": 293,
    "take": 325,
    "complete": 64,
    "program": 271,
    "what": 372,
    "length": 195,
    "of": 238,
    "duration": 98,
    "degree": 84,
    "year": 385,
    "many": 210,
    "month": 219,
    "last": 189,
    "one": 241,
    "total": 348,
    "time": 342,
    "need": 228,
    "finish": 125,
    "full": 135,
    "part": 253,
    "can": 51,
    "it": 180,
    "in": 170,
    "academic": 4,
    "cover": 72,
    "semester": 302,
    "divide": 92,
    "into": 179,
    "number": 236,
    "term": 331,
    "per": 256,
    "require": 286,
    "summer": 321,
    "include": 171,
    "structure": 315,
    "breakdown": 43,
    "credit": 73,
    "ect": 102,
    "load": 200,
    "requirement": 287,
    "for": 131,
    "graduation": 147,
    "minimum": 215,
    "optional": 246,
    "distribution": 91,
    "between": 37,
    "course": 71,
    "transfer": 349,
    "external": 119,
    "thesis": 338,
    "worth": 383,
    "list": 199,
    "all": 16,
    "available": 29,
    "show": 306,
    "offer": 239,
    "which": 375,
    "want": 364,
    "know": 186,
    "learning": 193,
    "tell": 330,
    "about": 2,
    "deep": 82,
    "dl": 93,
    "datum": 79,
    "mining": 216,
    "explain": 118,
    "nlp": 232,
    "m": 205,
    "interested": 175,
    "vision": 362,
    "reinforcement": 282,
    "learn": 192,
    "game": 137,
    "theory": 336,
    "teach": 327,
    "apply": 20,
    "get": 138,
    "accept": 5,
    "gpa": 146,
    "bachelor": 30,
    "cs": 75,
    "entrance": 109,
    "exam": 114,
    "work": 382,
    "experience": 117,
    "mandatory": 209,
    "document": 95,
    "should": 305,
    "submit": 318,
    "recommendation": 279,
    "letter": 197,
    "interview": 178,
    "process": 269,
    "ielt": 168,
    "toefl": 345,
    "score": 300,
    "without": 381,
    "tech": 329,
    "background": 32,
    "prerequisite": 265,
    "we": 367,
    "access": 6,
    "entry": 110,
    "qualify": 275,
    "condition": 66,
    "must": 224,
    "meet": 214,
    "join": 182,
    "enroll": 108,
    "admission": 9,
    "criterion": 74,
    "eligibility": 104,
    "application": 19,
    "qualification": 274,
    "when": 373,
    "start": 314,
    "much": 223,
    "cost": 69,
    "tuition": 351,
    "fee": 123,
    "price": 267,
    "additional": 7,
    "payment": 255,
    "plan": 262,
    "international": 176,
    "student": 316,
    "material": 212,
    "scholarship": 298,
    "discount": 89,
    "early": 100,
    "pay": 254,
    "installment": 172,
    "that": 334,
    "affordable": 11,
    "not": 234,
    "bad": 33,
    "waw": 365,
    "great": 148,
    "reasonable": 278,
    "perfect": 257,
    "thank": 333,
    "value": 360,
    "money": 218,
    "within": 380,
    "budget": 45,
    "fair": 121,
    "at": 25,
    "happy": 150,
    "oof": 244,
    "expensive": 116,
    "too": 346,
    "ouf": 249,
    "high": 156,
    "way": 366,
    "over": 251,
    "unaffordable": 353,
    "expect": 115,
    "cheap": 56,
    "afford": 10,
    "costly": 70,
    "option": 245,
    "beyond": 38,
    "mean": 213,
    "study": 317,
    "online": 242,
    "hybrid": 166,
    "remote": 284,
    "they": 339,
    "weekend": 370,
    "class": 60,
    "distance": 90,
    "while": 376,
    "after": 12,
    "hour": 162,
    "switch": 323,
    "and": 18,
    "flexibility": 127,
    "scheduling": 297,
    "only": 243,
    "on": 240,
    "campus": 50,
    "present": 266,
    "follow": 130,
    "attend": 26,
    "remotely": 285,
    "possible": 264,
    "from": 134,
    "abroad": 3,
    "home": 159,
    "format": 132,
    "move": 222,
    "lecture": 194,
    "job": 181,
    "design": 86,
    "professional": 270,
    "some": 309,
    "other": 248,
    "relocate": 283,
    "synchronous": 324,
    "asynchronous": 24,
    "support": 322,
    "flexible": 128,
    "internship": 177,
    "where": 374,
    "university": 355,
    "help": 153,
    "find": 124,
    "kind": 185,
    "unpaid": 356,
    "choose": 58,
    "company": 63,
    "language": 188,
    "english": 107,
    "french": 133,
    "if": 169,
    "speak": 312,
    "bilingual": 40,
    "write": 384,
    "primary": 268,
    "deadline": 81,
    "date": 78,
    "close": 61,
    "will": 378,
    "result": 288,
    "late": 190,
    "rolling": 291,
    "next": 229,
    "intake": 173,
    "defer": 83,
    "weekly": 371,
    "schedule": 296,
    "weekday": 369,
    "week": 368,
    "timetable": 343,
    "record": 280,
    "view": 361,
    "attendance": 27,
    "each": 99,
    "lab": 187,
    "session": 304,
    "usually": 359,
    "first": 126,
    "begin": 36,
    "pm": 263,
    "typical": 352,
    "end": 106,
    "lunch": 204,
    "break": 42,
    "back": 31,
    "hold": 158,
    "same": 294,
    "as": 23,
    "locate": 201,
    "city": 59,
    "urban": 357,
    "rural": 292,
    "area": 21,
    "housing": 163,
    "near": 227,
    "easy": 101,
    "public": 273,
    "transport": 350,
    "facility": 120,
    "visit": 363,
    "before": 35,
    "exactly": 113,
    "host": 161,
    "main": 207,
    "downtown": 96,
    "north": 233,
    "south": 311,
    "more": 220,
    "than": 332,
    "location": 202,
    "physically": 260,
    "science": 299,
    "satellite": 295,
    "different": 88,
    "address": 8,
    "teaching": 328,
    "build": 46,
    "building": 47,
    "shuttle": 307,
    "service": 303,
    "give": 139,
    "summary": 320,
    "overview": 252,
    "describe": 85,
    "summarize": 319,
    "curriculum": 77,
    "make": 208,
    "special": 313,
    "key": 184,
    "feature": 122,
    "highlight": 157,
    "focus": 129,
    "topic": 347,
    "education": 103,
    "unique": 354,
    "brief": 44,
    "objective": 237,
    "skill": 308,
    "gain": 136,
    "big": 39,
    "picture": 261,
    "outcome": 250,
    "philosophy": 259,
    "detail": 87,
    "content": 67,
    "provide": 272,
    "everything": 112
  },
  "intent": {
    "register_now": 20,
    "inform": 17,
    "bot_challenge": 14,
    "greet": 16,
    "goodbye": 15,
    "ask_duration": 7,
    "ask_semesters": 13,
    "ask_credits": 6,
    "ask_courses": 5,
    "ask_course_details": 4,
    "ask_admission": 0,
    "ask_price": 10,
    "positive_reaction": 19,
    "negative_reaction": 18,
    "ask_program_format": 11,
    "ask_internship": 8,
    "ask_language_of_instruction": 9,
    "ask_application_deadlines": 1,
    "ask_class_schedule": 3,
    "ask_campus_location": 2,
    "ask_program_summary": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_admission": 16,
    "utter_ask_application_deadlines": 17,
    "utter_ask_campus_location": 18,
    "utter_ask_class_schedule": 19,
    "utter_ask_courses": 20,
    "utter_ask_credits": 21,
    "utter_ask_duration": 22,
    "utter_ask_internship": 23,
    "utter_ask_language_of_instruction": 24,
    "utter_ask_price": 25,
    "utter_ask_program_format": 26,
    "utter_ask_program_summary": 27,
    "utter_ask_semesters": 28,
    "utter_goodbye": 29,
    "utter_greet": 30,
    "utter_happy_response": 31,
    "utter_iamabot": 32
  },
  "action_text": null,
  "intent_response_key": null
}