{
  "text": {
    "hey": 131,
    "hello": 129,
    "hi": 132,
    "there": 278,
    "good": 120,
    "morning": 189,
    "evening": 94,
    "moin": 186,
    "let": 166,
    "us": 298,
    "go": 119,
    "dude": 81,
    "goodmorning": 123,
    "goodevene": 122,
    "afternoon": 12,
    "cu": 63,
    "by": 41,
    "cee": 45,
    "you": 325,
    "later": 161,
    "night": 197,
    "bye": 42,
    "goodbye": 121,
    "have": 128,
    "a": 1,
    "nice": 196,
    "day": 67,
    "see": 250,
    "around": 20,
    "how": 138,
    "long": 172,
    "do": 79,
    "the": 276,
    "ai": 13,
    "master": 180,
    "s": 244,
    "take": 269,
    "to": 284,
    "complete": 52,
    "be": 30,
    "program": 229,
    "what": 312,
    "length": 165,
    "of": 202,
    "duration": 82,
    "degree": 71,
    "this": 281,
    "__number__": 0,
    "year": 324,
    "or": 211,
    "many": 179,
    "month": 188,
    "last": 159,
    "one": 205,
    "total": 288,
    "time": 282,
    "need": 194,
    "finish": 107,
    "full": 114,
    "part": 216,
    "can": 44,
    "i": 140,
    "it": 152,
    "in": 143,
    "academic": 4,
    "cover": 59,
    "semester": 251,
    "divide": 77,
    "into": 151,
    "number": 200,
    "term": 273,
    "per": 219,
    "require": 239,
    "summer": 266,
    "include": 144,
    "structure": 260,
    "breakdown": 38,
    "credit": 60,
    "ect": 86,
    "load": 170,
    "requirement": 240,
    "for": 112,
    "graduation": 125,
    "minimum": 184,
    "optional": 210,
    "distribution": 76,
    "between": 33,
    "course": 58,
    "transfer": 289,
    "external": 101,
    "thesis": 279,
    "worth": 322,
    "list": 169,
    "all": 14,
    "available": 25,
    "show": 254,
    "offer": 203,
    "which": 315,
    "want": 304,
    "know": 156,
    "machine": 175,
    "learning": 163,
    "tell": 272,
    "about": 2,
    "deep": 69,
    "dl": 78,
    "datum": 66,
    "mining": 185,
    "explain": 100,
    "nlp": 198,
    "m": 174,
    "interested": 147,
    "computer": 53,
    "vision": 302,
    "reinforcement": 237,
    "learn": 162,
    "game": 116,
    "theory": 277,
    "teach": 270,
    "apply": 18,
    "get": 117,
    "accept": 5,
    "gpa": 124,
    "bachelor": 26,
    "cs": 62,
    "entrance": 92,
    "exam": 96,
    "work": 321,
    "experience": 99,
    "mandatory": 178,
    "document": 80,
    "should": 253,
    "submit": 263,
    "recommendation": 235,
    "letter": 167,
    "an": 15,
    "interview": 150,
    "process": 228,
    "ielt": 141,
    "toefl": 285,
    "score": 249,
    "without": 320,
    "tech": 271,
    "background": 28,
    "prerequisite": 225,
    "we": 307,
    "access": 6,
    "entry": 93,
    "qualify": 233,
    "condition": 54,
    "must": 191,
    "meet": 183,
    "join": 153,
    "enroll": 91,
    "admission": 8,
    "criterion": 61,
    "eligibility": 88,
    "application": 17,
    "qualification": 232,
    "when": 313,
    "start": 259,
    "much": 190,
    "cost": 56,
    "tuition": 291,
    "fee": 105,
    "price": 226,
    "additional": 7,
    "payment": 218,
    "plan": 223,
    "international": 148,
    "student": 261,
    "material": 181,
    "scholarship": 248,
    "discount": 74,
    "early": 84,
    "pay": 217,
    "installment": 145,
    "that": 275,
    "affordable": 10,
    "not": 199,
    "bad": 29,
    "waw": 305,
    "great": 126,
    "reasonable": 234,
    "perfect": 220,
    "thank": 274,
    "like": 168,
    "value": 300,
    "money": 187,
    "within": 319,
    "my": 192,
    "budget": 40,
    "sound": 256,
    "fair": 103,
    "at": 22,
    "happy": 127,
    "with": 318,
    "oof": 208,
    "expensive": 98,
    "too": 286,
    "ouf": 212,
    "high": 133,
    "way": 306,
    "over": 214,
    "unaffordable": 293,
    "expect": 97,
    "cheap": 46,
    "afford": 9,
    "costly": 57,
    "option": 209,
    "beyond": 34,
    "mean": 182,
    "study": 262,
    "online": 206,
    "hybrid": 139,
    "remote": 238,
    "they": 280,
    "weekend": 310,
    "class": 49,
    "distance": 75,
    "while": 316,
    "after": 11,
    "hour": 136,
    "switch": 268,
    "and": 16,
    "flexibility": 109,
    "scheduling": 247,
    "internship": 149,
    "where": 314,
    "university": 295,
    "help": 130,
    "find": 106,
    "kind": 155,
    "abroad": 3,
    "unpaid": 296,
    "choose": 47,
    "company": 51,
    "language": 158,
    "english": 90,
    "french": 113,
    "if": 142,
    "speak": 257,
    "bilingual": 36,
    "write": 323,
    "support": 267,
    "attend": 23,
    "only": 207,
    "primary": 227,
    "deadline": 68,
    "date": 65,
    "close": 50,
    "will": 317,
    "result": 241,
    "late": 160,
    "rolling": 242,
    "next": 195,
    "intake": 146,
    "defer": 70,
    "weekly": 311,
    "schedule": 246,
    "on": 204,
    "weekday": 309,
    "week": 308,
    "timetable": 283,
    "record": 236,
    "view": 301,
    "attendance": 24,
    "each": 83,
    "lab": 157,
    "session": 252,
    "lecture": 164,
    "flexible": 110,
    "usually": 299,
    "first": 108,
    "begin": 32,
    "pm": 224,
    "typical": 292,
    "end": 89,
    "lunch": 173,
    "break": 37,
    "back": 27,
    "hold": 135,
    "same": 245,
    "as": 21,
    "locate": 171,
    "city": 48,
    "campus": 43,
    "urban": 297,
    "rural": 243,
    "area": 19,
    "housing": 137,
    "near": 193,
    "easy": 85,
    "public": 231,
    "transport": 290,
    "facility": 102,
    "visit": 303,
    "before": 31,
    "give": 118,
    "summary": 265,
    "overview": 215,
    "describe": 72,
    "summarize": 264,
    "curriculum": 64,
    "make": 177,
    "special": 258,
    "key": 154,
    "feature": 104,
    "highlight": 134,
    "focus": 111,
    "main": 176,
    "topic": 287,
    "education": 87,
    "unique": 294,
    "brief": 39,
    "objective": 201,
    "skill": 255,
    "gain": 115,
    "big": 35,
    "picture": 222,
    "outcome": 213,
    "philosophy": 221,
    "detail": 73,
    "content": 55,
    "provide": 230,
    "everything": 95
  },
  "intent": {
    "greet": 16,
    "goodbye": 15,
    "ask_duration": 7,
    "ask_semesters": 13,
    "ask_credits": 6,
    "ask_courses": 5,
    "ask_course_details": 4,
    "ask_admission": 0,
    "ask_price": 10,
    "positive_reaction": 18,
    "negative_reaction": 17,
    "ask_program_format": 11,
    "ask_internship": 8,
    "ask_language_of_instruction": 9,
    "ask_application_deadlines": 1,
    "ask_class_schedule": 3,
    "ask_campus_location": 2,
    "ask_program_summary": 12,
    "bot_challenge": 14
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_aid_info": 12,
    "utter_ask_admission": 13,
    "utter_ask_application_deadlines": 14,
    "utter_ask_campus_location": 15,
    "utter_ask_class_schedule": 16,
    "utter_ask_courses": 17,
    "utter_ask_credits": 18,
    "utter_ask_duration": 19,
    "utter_ask_internship": 20,
    "utter_ask_language_of_instruction": 21,
    "utter_ask_price": 22,
    "utter_ask_program_format": 23,
    "utter_ask_program_summary": 24,
    "utter_ask_semesters": 25,
    "utter_goodbye": 26,
    "utter_greet": 27,
    "utter_happy_response": 28,
    "utter_iamabot": 29
  },
  "action_text": null,
  "intent_response_key": null
}