{
  "text": {
    "register": 352,
    "now": 289,
    "i": 200,
    "hadi": 181,
    "my": 277,
    "name": 278,
    "be": 40,
    "aya": 35,
    "you": 470,
    "can": 59,
    "call": 57,
    "fatima": 147,
    "jad": 219,
    "nasrallah": 280,
    "it": 217,
    "sara": 367,
    "elie": 124,
    "go": 170,
    "by": 54,
    "lina": 244,
    "the": 410,
    "s": 365,
    "omar": 295,
    "mohamad": 269,
    "cynthia": 91,
    "ch": 62,
    "__number__": 0,
    "gmail": 169,
    "com": 71,
    "email": 126,
    "at": 28,
    "ay": 34,
    "reach": 346,
    "d": 92,
    "send": 376,
    "info": 205,
    "to": 421,
    "nasr": 279,
    "here": 186,
    "k": 225,
    "hotmail": 194,
    "h": 180,
    "usj": 439,
    "edu": 122,
    "university": 433,
    "drop": 113,
    "rizk23": 360,
    "yahoo": 468,
    "use": 438,
    "khalil": 227,
    "m": 252,
    "protonmail": 339,
    "for": 159,
    "school": 371,
    "mariah": 258,
    "j": 218,
    "example": 137,
    "jean": 220,
    "marianne": 259,
    "ali": 16,
    "a": 1,
    "bot": 48,
    "human": 198,
    "this": 417,
    "real": 347,
    "person": 321,
    "talk": 400,
    "chat": 63,
    "with": 462,
    "right": 359,
    "an": 20,
    "ai": 14,
    "just": 224,
    "computer": 74,
    "automate": 32,
    "chatbot": 64,
    "who": 460,
    "conversation": 79,
    "alive": 17,
    "intelligent": 209,
    "sound": 386,
    "like": 243,
    "robot": 361,
    "or": 305,
    "machine": 253,
    "think": 416,
    "re": 345,
    "honest": 192,
    "hey": 187,
    "hello": 184,
    "hi": 188,
    "there": 414,
    "good": 171,
    "morning": 274,
    "evening": 133,
    "moin": 270,
    "let": 241,
    "us": 437,
    "dude": 114,
    "goodmorning": 174,
    "goodevene": 173,
    "afternoon": 13,
    "cu": 89,
    "cee": 61,
    "later": 235,
    "night": 285,
    "bye": 55,
    "goodbye": 172,
    "have": 183,
    "nice": 284,
    "day": 95,
    "see": 374,
    "around": 26,
    "how": 197,
    "long": 249,
    "do": 110,
    "master": 260,
    "take": 399,
    "complete": 73,
    "program": 336,
    "what": 456,
    "length": 240,
    "of": 292,
    "duration": 115,
    "degree": 99,
    "year": 469,
    "many": 257,
    "month": 272,
    "last": 233,
    "one": 297,
    "total": 426,
    "time": 418,
    "need": 282,
    "finish": 153,
    "full": 163,
    "part": 314,
    "in": 203,
    "academic": 4,
    "cover": 85,
    "about": 2,
    "semester": 375,
    "divide": 108,
    "into": 215,
    "number": 290,
    "term": 406,
    "per": 317,
    "require": 355,
    "structure": 391,
    "breakdown": 50,
    "each": 117,
    "credit": 86,
    "ect": 121,
    "load": 246,
    "requirement": 356,
    "graduation": 177,
    "minimum": 266,
    "optional": 304,
    "distribution": 107,
    "between": 44,
    "course": 84,
    "transfer": 427,
    "external": 143,
    "thesis": 415,
    "worth": 466,
    "include": 204,
    "list": 245,
    "all": 18,
    "available": 33,
    "show": 380,
    "offer": 294,
    "which": 459,
    "want": 448,
    "know": 229,
    "learning": 238,
    "tell": 405,
    "deep": 97,
    "dl": 109,
    "datum": 94,
    "mining": 267,
    "explain": 142,
    "nlp": 286,
    "interested": 211,
    "vision": 445,
    "reinforcement": 353,
    "learn": 237,
    "game": 166,
    "theory": 413,
    "teach": 401,
    "content": 77,
    "apply": 24,
    "get": 167,
    "accept": 5,
    "gpa": 175,
    "bachelor": 36,
    "cs": 88,
    "entrance": 131,
    "exam": 136,
    "work": 465,
    "experience": 140,
    "mandatory": 256,
    "document": 111,
    "should": 379,
    "submit": 394,
    "recommendation": 350,
    "letter": 242,
    "interview": 214,
    "process": 333,
    "ielt": 201,
    "toefl": 422,
    "score": 373,
    "without": 464,
    "tech": 404,
    "background": 38,
    "prerequisite": 330,
    "we": 451,
    "access": 6,
    "entry": 132,
    "qualify": 344,
    "condition": 75,
    "must": 276,
    "meet": 264,
    "join": 222,
    "enroll": 129,
    "admission": 9,
    "criterion": 87,
    "eligibility": 125,
    "application": 23,
    "qualification": 343,
    "when": 457,
    "start": 390,
    "any": 22,
    "enter": 130,
    "much": 275,
    "cost": 81,
    "tuition": 429,
    "fee": 149,
    "price": 331,
    "additional": 7,
    "payment": 316,
    "plan": 327,
    "international": 212,
    "student": 392,
    "material": 261,
    "scholarship": 370,
    "discount": 105,
    "early": 118,
    "pay": 315,
    "installment": 206,
    "that": 409,
    "cool": 80,
    "affordable": 11,
    "not": 288,
    "bad": 39,
    "waw": 449,
    "great": 179,
    "reasonable": 348,
    "perfect": 320,
    "thank": 408,
    "value": 442,
    "money": 271,
    "within": 463,
    "budget": 51,
    "fair": 146,
    "happy": 182,
    "oof": 301,
    "expensive": 139,
    "too": 423,
    "ouf": 308,
    "high": 189,
    "way": 450,
    "over": 310,
    "unaffordable": 431,
    "expect": 138,
    "cheap": 65,
    "afford": 10,
    "costly": 82,
    "option": 303,
    "beyond": 45,
    "mean": 263,
    "internship": 213,
    "where": 458,
    "help": 185,
    "find": 152,
    "kind": 228,
    "abroad": 3,
    "unpaid": 434,
    "choose": 66,
    "company": 72,
    "language": 232,
    "english": 128,
    "french": 161,
    "study": 393,
    "if": 202,
    "speak": 388,
    "class": 68,
    "bilingual": 47,
    "write": 467,
    "support": 398,
    "attend": 29,
    "only": 299,
    "primary": 332,
    "laguage": 231,
    "deadline": 96,
    "date": 93,
    "after": 12,
    "close": 69,
    "will": 461,
    "result": 358,
    "late": 234,
    "rolling": 363,
    "next": 283,
    "intake": 208,
    "defer": 98,
    "weekly": 455,
    "schedule": 369,
    "on": 296,
    "weekday": 453,
    "weekend": 454,
    "hour": 195,
    "week": 452,
    "timetable": 419,
    "record": 351,
    "view": 444,
    "attendance": 30,
    "lab": 230,
    "session": 378,
    "lecture": 239,
    "flexible": 156,
    "usually": 440,
    "first": 154,
    "begin": 42,
    "pm": 328,
    "typical": 430,
    "end": 127,
    "lunch": 251,
    "break": 49,
    "back": 37,
    "hold": 191,
    "same": 366,
    "as": 27,
    "look": 250,
    "timing": 420,
    "could": 83,
    "organize": 306,
    "place": 326,
    "give": 168,
    "detail": 103,
    "calender": 56,
    "locate": 247,
    "city": 67,
    "campus": 58,
    "urban": 436,
    "rural": 364,
    "area": 25,
    "housing": 196,
    "near": 281,
    "easy": 120,
    "public": 341,
    "transport": 428,
    "facility": 144,
    "visit": 446,
    "before": 41,
    "exactly": 135,
    "host": 193,
    "main": 254,
    "downtown": 112,
    "north": 287,
    "south": 387,
    "more": 273,
    "than": 407,
    "location": 248,
    "physically": 324,
    "science": 372,
    "satellite": 368,
    "different": 104,
    "address": 8,
    "teaching": 403,
    "build": 52,
    "building": 53,
    "shuttle": 381,
    "service": 377,
    "summary": 396,
    "overview": 311,
    "describe": 102,
    "summarize": 395,
    "curriculum": 90,
    "make": 255,
    "special": 389,
    "key": 226,
    "feature": 148,
    "highlight": 190,
    "focus": 157,
    "topic": 425,
    "education": 123,
    "unique": 432,
    "objective": 291,
    "skill": 383,
    "gain": 165,
    "big": 46,
    "picture": 325,
    "outcome": 309,
    "philosophy": 322,
    "provide": 340,
    "everything": 134,
    "up": 435,
    "possible": 329,
    "financial": 151,
    "aid": 15,
    "off": 293,
    "maximum": 262,
    "percent": 318,
    "grant": 178,
    "amount": 19,
    "receive": 349,
    "waiver": 447,
    "top": 424,
    "benefit": 43,
    "from": 162,
    "percentage": 319,
    "package": 312,
    "social": 384,
    "instructor": 207,
    "professor": 335,
    "involve": 216,
    "faculty": 145,
    "member": 265,
    "teacher": 402,
    "lead": 236,
    "expert": 141,
    "deliver": 100,
    "summer": 397,
    "during": 116,
    "vacation": 441,
    "continue": 78,
    "july": 223,
    "and": 21,
    "august": 31,
    "job": 221,
    "opportunity": 302,
    "graduate": 176,
    "career": 60,
    "follow": 158,
    "easily": 119,
    "role": 362,
    "professionally": 334,
    "prospect": 338,
    "then": 412,
    "research": 357,
    "project": 337,
    "final": 150,
    "publish": 342,
    "paper": 313,
    "their": 411,
    "interest": 210,
    "some": 385,
    "department": 101,
    "conference": 76,
    "collaborate": 70,
    "online": 298,
    "hybrid": 199,
    "format": 160,
    "version": 443,
    "fully": 164,
    "remotely": 354,
    "distance": 106,
    "physical": 323,
    "mode": 268,
    "flexibility": 155,
    "site": 382,
    "other": 307,
    "onsite": 300
  },
  "intent": {
    "register_now": 26,
    "inform": 22,
    "bot_challenge": 19,
    "greet": 21,
    "goodbye": 20,
    "ask_duration": 8,
    "ask_semesters": 17,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 25,
    "negative_reaction": 23,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 16,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12,
    "ask_thesis_and_research": 18,
    "ask_program_format": 15,
    "nlu_fallback": 24
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "action_course_details": 1,
    "action_say_data": 10,
    "simple_form": 14,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_format": 30,
    "utter_ask_program_summary": 31,
    "utter_ask_semesters": 32,
    "utter_ask_thesis_and_research": 33,
    "utter_default": 34,
    "utter_goodbye": 35,
    "utter_greet": 36,
    "utter_happy_response": 37,
    "utter_iamabot": 38
  },
  "action_text": null,
  "intent_response_key": null
}