{
  "text": {
    "register": 342,
    "now": 283,
    "i": 195,
    "hadi": 177,
    "my": 271,
    "name": 272,
    "be": 40,
    "aya": 35,
    "you": 457,
    "can": 59,
    "call": 57,
    "fatima": 146,
    "jad": 214,
    "nasrallah": 274,
    "it": 212,
    "sara": 356,
    "elie": 123,
    "go": 166,
    "by": 54,
    "lina": 239,
    "the": 398,
    "s": 354,
    "omar": 289,
    "mohamad": 263,
    "cynthia": 91,
    "ch": 62,
    "__number__": 0,
    "gmail": 165,
    "com": 71,
    "email": 125,
    "at": 28,
    "ay": 34,
    "reach": 336,
    "d": 92,
    "send": 365,
    "info": 200,
    "to": 409,
    "nasr": 273,
    "here": 182,
    "k": 220,
    "hotmail": 190,
    "h": 176,
    "usj": 427,
    "edu": 121,
    "university": 421,
    "drop": 112,
    "rizk23": 349,
    "yahoo": 455,
    "use": 426,
    "khalil": 222,
    "m": 247,
    "protonmail": 329,
    "for": 157,
    "school": 360,
    "mariah": 253,
    "j": 213,
    "example": 136,
    "jean": 215,
    "marianne": 254,
    "ali": 16,
    "a": 1,
    "bot": 48,
    "human": 194,
    "this": 405,
    "real": 337,
    "person": 312,
    "talk": 388,
    "chat": 63,
    "with": 449,
    "right": 348,
    "an": 20,
    "ai": 14,
    "just": 219,
    "computer": 74,
    "automate": 32,
    "chatbot": 64,
    "who": 447,
    "conversation": 79,
    "alive": 17,
    "intelligent": 204,
    "sound": 374,
    "like": 238,
    "robot": 350,
    "or": 297,
    "machine": 248,
    "think": 404,
    "re": 335,
    "honest": 188,
    "hey": 183,
    "hello": 180,
    "hi": 184,
    "there": 402,
    "good": 167,
    "morning": 268,
    "evening": 132,
    "moin": 264,
    "let": 236,
    "us": 425,
    "dude": 113,
    "goodmorning": 170,
    "goodevene": 169,
    "afternoon": 13,
    "cu": 89,
    "cee": 61,
    "later": 230,
    "night": 279,
    "bye": 55,
    "goodbye": 168,
    "have": 179,
    "nice": 278,
    "day": 95,
    "see": 363,
    "around": 26,
    "how": 193,
    "long": 244,
    "do": 109,
    "master": 255,
    "take": 387,
    "complete": 73,
    "program": 326,
    "what": 443,
    "length": 235,
    "of": 286,
    "duration": 114,
    "degree": 99,
    "year": 456,
    "many": 252,
    "month": 266,
    "last": 228,
    "one": 291,
    "total": 414,
    "time": 406,
    "need": 276,
    "finish": 152,
    "full": 160,
    "part": 305,
    "in": 198,
    "academic": 4,
    "cover": 85,
    "about": 2,
    "semester": 364,
    "divide": 107,
    "into": 210,
    "number": 284,
    "term": 394,
    "per": 308,
    "require": 344,
    "structure": 379,
    "breakdown": 50,
    "each": 116,
    "credit": 86,
    "ect": 120,
    "load": 241,
    "requirement": 345,
    "graduation": 173,
    "minimum": 261,
    "optional": 296,
    "distribution": 106,
    "between": 44,
    "course": 84,
    "transfer": 415,
    "external": 142,
    "thesis": 403,
    "worth": 453,
    "include": 199,
    "list": 240,
    "all": 18,
    "available": 33,
    "show": 369,
    "offer": 288,
    "which": 446,
    "want": 435,
    "know": 224,
    "learning": 233,
    "tell": 393,
    "deep": 97,
    "dl": 108,
    "datum": 94,
    "mining": 262,
    "explain": 141,
    "nlp": 280,
    "interested": 206,
    "vision": 432,
    "reinforcement": 343,
    "learn": 232,
    "game": 162,
    "theory": 401,
    "teach": 389,
    "content": 77,
    "apply": 24,
    "get": 163,
    "accept": 5,
    "gpa": 171,
    "bachelor": 36,
    "cs": 88,
    "entrance": 130,
    "exam": 135,
    "work": 452,
    "experience": 139,
    "mandatory": 251,
    "document": 110,
    "should": 368,
    "submit": 382,
    "recommendation": 340,
    "letter": 237,
    "interview": 209,
    "process": 323,
    "ielt": 196,
    "toefl": 410,
    "score": 362,
    "without": 451,
    "tech": 392,
    "background": 38,
    "prerequisite": 320,
    "we": 438,
    "access": 6,
    "entry": 131,
    "qualify": 334,
    "condition": 75,
    "must": 270,
    "meet": 259,
    "join": 217,
    "enroll": 128,
    "admission": 9,
    "criterion": 87,
    "eligibility": 124,
    "application": 23,
    "qualification": 333,
    "when": 444,
    "start": 378,
    "any": 22,
    "enter": 129,
    "much": 269,
    "cost": 81,
    "tuition": 417,
    "fee": 148,
    "price": 321,
    "additional": 7,
    "payment": 307,
    "plan": 317,
    "international": 207,
    "student": 380,
    "material": 256,
    "scholarship": 359,
    "discount": 105,
    "early": 117,
    "pay": 306,
    "installment": 201,
    "that": 397,
    "cool": 80,
    "affordable": 11,
    "not": 282,
    "bad": 39,
    "waw": 436,
    "great": 175,
    "reasonable": 338,
    "perfect": 311,
    "thank": 396,
    "value": 430,
    "money": 265,
    "within": 450,
    "budget": 51,
    "fair": 145,
    "happy": 178,
    "oof": 293,
    "expensive": 138,
    "too": 411,
    "ouf": 299,
    "high": 185,
    "way": 437,
    "over": 301,
    "unaffordable": 419,
    "expect": 137,
    "cheap": 65,
    "afford": 10,
    "costly": 82,
    "option": 295,
    "beyond": 45,
    "mean": 258,
    "internship": 208,
    "where": 445,
    "help": 181,
    "find": 151,
    "kind": 223,
    "abroad": 3,
    "unpaid": 422,
    "choose": 66,
    "company": 72,
    "language": 227,
    "english": 127,
    "french": 158,
    "study": 381,
    "if": 197,
    "speak": 376,
    "class": 68,
    "bilingual": 47,
    "write": 454,
    "support": 386,
    "attend": 29,
    "only": 292,
    "primary": 322,
    "laguage": 226,
    "deadline": 96,
    "date": 93,
    "after": 12,
    "close": 69,
    "will": 448,
    "result": 347,
    "late": 229,
    "rolling": 352,
    "next": 277,
    "intake": 203,
    "defer": 98,
    "weekly": 442,
    "schedule": 358,
    "on": 290,
    "weekday": 440,
    "weekend": 441,
    "hour": 191,
    "week": 439,
    "timetable": 407,
    "record": 341,
    "view": 431,
    "attendance": 30,
    "lab": 225,
    "session": 367,
    "lecture": 234,
    "flexible": 154,
    "usually": 428,
    "first": 153,
    "begin": 42,
    "pm": 318,
    "typical": 418,
    "end": 126,
    "lunch": 246,
    "break": 49,
    "back": 37,
    "hold": 187,
    "same": 355,
    "as": 27,
    "look": 245,
    "timing": 408,
    "could": 83,
    "organize": 298,
    "place": 316,
    "give": 164,
    "detail": 103,
    "calender": 56,
    "locate": 242,
    "city": 67,
    "campus": 58,
    "urban": 424,
    "rural": 353,
    "area": 25,
    "housing": 192,
    "near": 275,
    "easy": 119,
    "public": 331,
    "transport": 416,
    "facility": 143,
    "visit": 433,
    "before": 41,
    "exactly": 134,
    "host": 189,
    "main": 249,
    "downtown": 111,
    "north": 281,
    "south": 375,
    "more": 267,
    "than": 395,
    "location": 243,
    "physically": 314,
    "science": 361,
    "satellite": 357,
    "different": 104,
    "address": 8,
    "teaching": 391,
    "build": 52,
    "building": 53,
    "shuttle": 370,
    "service": 366,
    "summary": 384,
    "overview": 302,
    "describe": 102,
    "summarize": 383,
    "curriculum": 90,
    "make": 250,
    "special": 377,
    "key": 221,
    "feature": 147,
    "highlight": 186,
    "focus": 155,
    "topic": 413,
    "education": 122,
    "unique": 420,
    "objective": 285,
    "skill": 371,
    "gain": 161,
    "big": 46,
    "picture": 315,
    "outcome": 300,
    "philosophy": 313,
    "provide": 330,
    "everything": 133,
    "up": 423,
    "possible": 319,
    "financial": 150,
    "aid": 15,
    "off": 287,
    "maximum": 257,
    "percent": 309,
    "grant": 174,
    "amount": 19,
    "receive": 339,
    "waiver": 434,
    "top": 412,
    "benefit": 43,
    "from": 159,
    "percentage": 310,
    "package": 303,
    "social": 372,
    "instructor": 202,
    "professor": 325,
    "involve": 211,
    "faculty": 144,
    "member": 260,
    "teacher": 390,
    "lead": 231,
    "expert": 140,
    "deliver": 100,
    "summer": 385,
    "during": 115,
    "vacation": 429,
    "continue": 78,
    "july": 218,
    "and": 21,
    "august": 31,
    "job": 216,
    "opportunity": 294,
    "graduate": 172,
    "career": 60,
    "follow": 156,
    "easily": 118,
    "role": 351,
    "professionally": 324,
    "prospect": 328,
    "then": 400,
    "research": 346,
    "project": 327,
    "final": 149,
    "publish": 332,
    "paper": 304,
    "their": 399,
    "interest": 205,
    "some": 373,
    "department": 101,
    "conference": 76,
    "collaborate": 70
  },
  "intent": {
    "register_now": 25,
    "inform": 21,
    "bot_challenge": 18,
    "greet": 20,
    "goodbye": 19,
    "ask_duration": 8,
    "ask_semesters": 16,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 24,
    "negative_reaction": 22,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 15,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12,
    "ask_thesis_and_research": 17,
    "nlu_fallback": 23
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "action_course_details": 1,
    "action_say_data": 10,
    "simple_form": 14,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_summary": 30,
    "utter_ask_semesters": 31,
    "utter_ask_thesis_and_research": 32,
    "utter_default": 33,
    "utter_goodbye": 34,
    "utter_greet": 35,
    "utter_happy_response": 36,
    "utter_iamabot": 37
  },
  "action_text": null,
  "intent_response_key": null
}