{
  "text": {
    "hey": 142,
    "hello": 140,
    "hi": 143,
    "there": 313,
    "good": 131,
    "morning": 205,
    "evening": 101,
    "moin": 201,
    "let": 180,
    "us": 333,
    "go": 130,
    "dude": 88,
    "goodmorning": 134,
    "goodevene": 133,
    "afternoon": 13,
    "cu": 67,
    "by": 45,
    "cee": 49,
    "you": 360,
    "later": 175,
    "night": 214,
    "bye": 46,
    "goodbye": 132,
    "have": 139,
    "a": 1,
    "nice": 213,
    "day": 71,
    "see": 278,
    "around": 21,
    "how": 151,
    "long": 187,
    "do": 85,
    "the": 311,
    "ai": 14,
    "master": 195,
    "s": 270,
    "take": 302,
    "to": 319,
    "complete": 56,
    "be": 32,
    "program": 253,
    "what": 347,
    "length": 179,
    "of": 220,
    "duration": 89,
    "degree": 75,
    "this": 316,
    "__number__": 0,
    "year": 359,
    "or": 229,
    "many": 194,
    "month": 203,
    "last": 173,
    "one": 223,
    "total": 323,
    "time": 317,
    "need": 211,
    "finish": 115,
    "full": 125,
    "part": 235,
    "can": 48,
    "i": 153,
    "it": 165,
    "in": 156,
    "academic": 4,
    "cover": 63,
    "semester": 279,
    "divide": 83,
    "into": 164,
    "number": 218,
    "term": 307,
    "per": 238,
    "require": 265,
    "summer": 298,
    "include": 157,
    "structure": 292,
    "breakdown": 40,
    "credit": 64,
    "ect": 93,
    "load": 184,
    "requirement": 266,
    "for": 121,
    "graduation": 136,
    "minimum": 199,
    "optional": 228,
    "distribution": 82,
    "between": 35,
    "course": 62,
    "transfer": 324,
    "external": 109,
    "thesis": 314,
    "worth": 357,
    "list": 183,
    "all": 15,
    "available": 27,
    "show": 283,
    "offer": 221,
    "which": 350,
    "want": 339,
    "know": 170,
    "machine": 190,
    "learning": 177,
    "tell": 306,
    "about": 2,
    "deep": 73,
    "dl": 84,
    "datum": 70,
    "mining": 200,
    "explain": 108,
    "nlp": 215,
    "m": 189,
    "interested": 160,
    "computer": 57,
    "vision": 337,
    "reinforcement": 261,
    "learn": 176,
    "game": 127,
    "theory": 312,
    "teach": 303,
    "apply": 19,
    "get": 128,
    "accept": 5,
    "gpa": 135,
    "bachelor": 28,
    "cs": 66,
    "entrance": 99,
    "exam": 104,
    "work": 356,
    "experience": 107,
    "mandatory": 193,
    "document": 86,
    "should": 282,
    "submit": 295,
    "recommendation": 259,
    "letter": 181,
    "an": 16,
    "interview": 163,
    "process": 251,
    "ielt": 154,
    "toefl": 320,
    "score": 277,
    "without": 355,
    "tech": 305,
    "background": 30,
    "prerequisite": 247,
    "we": 342,
    "access": 6,
    "entry": 100,
    "qualify": 257,
    "condition": 58,
    "must": 208,
    "meet": 198,
    "join": 167,
    "enroll": 98,
    "admission": 9,
    "criterion": 65,
    "eligibility": 95,
    "application": 18,
    "qualification": 256,
    "when": 348,
    "start": 291,
    "much": 207,
    "cost": 60,
    "tuition": 326,
    "fee": 113,
    "price": 249,
    "additional": 7,
    "payment": 237,
    "plan": 244,
    "international": 161,
    "student": 293,
    "material": 196,
    "scholarship": 275,
    "discount": 80,
    "early": 91,
    "pay": 236,
    "installment": 158,
    "that": 310,
    "affordable": 11,
    "not": 217,
    "bad": 31,
    "waw": 340,
    "great": 137,
    "reasonable": 258,
    "perfect": 239,
    "thank": 309,
    "like": 182,
    "value": 335,
    "money": 202,
    "within": 354,
    "my": 209,
    "budget": 42,
    "sound": 287,
    "fair": 111,
    "at": 24,
    "happy": 138,
    "with": 353,
    "oof": 226,
    "expensive": 106,
    "too": 321,
    "ouf": 231,
    "high": 144,
    "way": 341,
    "over": 233,
    "unaffordable": 328,
    "expect": 105,
    "cheap": 50,
    "afford": 10,
    "costly": 61,
    "option": 227,
    "beyond": 36,
    "mean": 197,
    "study": 294,
    "online": 224,
    "hybrid": 152,
    "remote": 263,
    "they": 315,
    "weekend": 345,
    "class": 53,
    "distance": 81,
    "while": 351,
    "after": 12,
    "hour": 149,
    "switch": 300,
    "and": 17,
    "flexibility": 117,
    "scheduling": 274,
    "only": 225,
    "on": 222,
    "campus": 47,
    "present": 248,
    "follow": 120,
    "attend": 25,
    "remotely": 264,
    "possible": 246,
    "from": 124,
    "abroad": 3,
    "home": 147,
    "format": 122,
    "move": 206,
    "person": 240,
    "lecture": 178,
    "job": 166,
    "design": 77,
    "professional": 252,
    "some": 286,
    "other": 230,
    "relocate": 262,
    "synchronous": 301,
    "asynchronous": 23,
    "support": 299,
    "flexible": 118,
    "internship": 162,
    "where": 349,
    "university": 330,
    "help": 141,
    "find": 114,
    "kind": 169,
    "unpaid": 331,
    "choose": 51,
    "company": 55,
    "language": 172,
    "english": 97,
    "french": 123,
    "if": 155,
    "speak": 289,
    "bilingual": 38,
    "write": 358,
    "primary": 250,
    "deadline": 72,
    "date": 69,
    "close": 54,
    "will": 352,
    "result": 267,
    "late": 174,
    "rolling": 268,
    "next": 212,
    "intake": 159,
    "defer": 74,
    "weekly": 346,
    "schedule": 273,
    "weekday": 344,
    "week": 343,
    "timetable": 318,
    "record": 260,
    "view": 336,
    "attendance": 26,
    "each": 90,
    "lab": 171,
    "session": 281,
    "usually": 334,
    "first": 116,
    "begin": 34,
    "pm": 245,
    "typical": 327,
    "end": 96,
    "lunch": 188,
    "break": 39,
    "back": 29,
    "hold": 146,
    "same": 271,
    "as": 22,
    "locate": 185,
    "city": 52,
    "urban": 332,
    "rural": 269,
    "area": 20,
    "housing": 150,
    "near": 210,
    "easy": 92,
    "public": 255,
    "transport": 325,
    "facility": 110,
    "visit": 338,
    "before": 33,
    "exactly": 103,
    "host": 148,
    "main": 191,
    "downtown": 87,
    "north": 216,
    "south": 288,
    "more": 204,
    "than": 308,
    "location": 186,
    "physically": 242,
    "science": 276,
    "satellite": 272,
    "different": 79,
    "address": 8,
    "teaching": 304,
    "build": 43,
    "building": 44,
    "shuttle": 284,
    "service": 280,
    "give": 129,
    "summary": 297,
    "overview": 234,
    "describe": 76,
    "summarize": 296,
    "curriculum": 68,
    "make": 192,
    "special": 290,
    "key": 168,
    "feature": 112,
    "highlight": 145,
    "focus": 119,
    "topic": 322,
    "education": 94,
    "unique": 329,
    "brief": 41,
    "objective": 219,
    "skill": 285,
    "gain": 126,
    "big": 37,
    "picture": 243,
    "outcome": 232,
    "philosophy": 241,
    "detail": 78,
    "content": 59,
    "provide": 254,
    "everything": 102
  },
  "intent": {
    "greet": 16,
    "goodbye": 15,
    "ask_duration": 7,
    "ask_semesters": 13,
    "ask_credits": 6,
    "ask_courses": 5,
    "ask_course_details": 4,
    "ask_admission": 0,
    "ask_price": 10,
    "positive_reaction": 18,
    "negative_reaction": 17,
    "ask_program_format": 11,
    "ask_internship": 8,
    "ask_language_of_instruction": 9,
    "ask_application_deadlines": 1,
    "ask_class_schedule": 3,
    "ask_campus_location": 2,
    "ask_program_summary": 12,
    "bot_challenge": 14
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 9,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 10,
    "action_unlikely_intent": 11,
    "action_back": 0,
    "action_extract_slots": 5,
    "utter_aid_info": 12,
    "utter_ask_admission": 13,
    "utter_ask_application_deadlines": 14,
    "utter_ask_campus_location": 15,
    "utter_ask_class_schedule": 16,
    "utter_ask_courses": 17,
    "utter_ask_credits": 18,
    "utter_ask_duration": 19,
    "utter_ask_internship": 20,
    "utter_ask_language_of_instruction": 21,
    "utter_ask_price": 22,
    "utter_ask_program_format": 23,
    "utter_ask_program_summary": 24,
    "utter_ask_semesters": 25,
    "utter_goodbye": 26,
    "utter_greet": 27,
    "utter_happy_response": 28,
    "utter_iamabot": 29
  },
  "action_text": null,
  "intent_response_key": null
}