{
  "text": {
    "register": 334,
    "now": 278,
    "i": 191,
    "hadi": 173,
    "my": 266,
    "name": 267,
    "be": 40,
    "aya": 35,
    "you": 446,
    "can": 59,
    "call": 57,
    "fatima": 143,
    "jad": 209,
    "nasrallah": 269,
    "it": 207,
    "sara": 347,
    "elie": 120,
    "go": 162,
    "by": 54,
    "lina": 234,
    "the": 388,
    "s": 345,
    "omar": 284,
    "mohamad": 258,
    "cynthia": 89,
    "ch": 62,
    "__number__": 0,
    "gmail": 161,
    "com": 70,
    "email": 122,
    "at": 28,
    "ay": 34,
    "reach": 328,
    "d": 90,
    "send": 356,
    "info": 196,
    "to": 398,
    "nasr": 268,
    "here": 178,
    "k": 215,
    "hotmail": 186,
    "h": 172,
    "usj": 416,
    "edu": 118,
    "university": 410,
    "drop": 109,
    "rizk23": 340,
    "yahoo": 444,
    "use": 415,
    "khalil": 217,
    "m": 242,
    "protonmail": 322,
    "for": 153,
    "school": 351,
    "mariah": 248,
    "j": 208,
    "example": 133,
    "jean": 210,
    "marianne": 249,
    "ali": 16,
    "a": 1,
    "bot": 48,
    "human": 190,
    "this": 394,
    "real": 329,
    "person": 306,
    "talk": 378,
    "chat": 63,
    "with": 438,
    "right": 339,
    "an": 20,
    "ai": 14,
    "just": 214,
    "computer": 73,
    "automate": 32,
    "chatbot": 64,
    "who": 436,
    "conversation": 77,
    "alive": 17,
    "intelligent": 200,
    "sound": 364,
    "like": 233,
    "robot": 341,
    "or": 292,
    "machine": 243,
    "think": 393,
    "re": 327,
    "honest": 184,
    "hey": 179,
    "hello": 176,
    "hi": 180,
    "there": 391,
    "good": 163,
    "morning": 263,
    "evening": 129,
    "moin": 259,
    "let": 231,
    "us": 414,
    "dude": 110,
    "goodmorning": 166,
    "goodevene": 165,
    "afternoon": 13,
    "cu": 87,
    "cee": 61,
    "later": 225,
    "night": 274,
    "bye": 55,
    "goodbye": 164,
    "have": 175,
    "nice": 273,
    "day": 93,
    "see": 354,
    "around": 26,
    "how": 189,
    "long": 239,
    "do": 106,
    "master": 250,
    "take": 377,
    "complete": 72,
    "program": 320,
    "what": 432,
    "length": 230,
    "of": 281,
    "duration": 111,
    "degree": 97,
    "year": 445,
    "many": 247,
    "month": 261,
    "last": 223,
    "one": 286,
    "total": 403,
    "time": 395,
    "need": 271,
    "finish": 148,
    "full": 156,
    "part": 299,
    "in": 194,
    "academic": 4,
    "cover": 83,
    "about": 2,
    "semester": 355,
    "divide": 104,
    "into": 205,
    "number": 279,
    "term": 384,
    "per": 302,
    "require": 336,
    "structure": 369,
    "breakdown": 50,
    "each": 113,
    "credit": 84,
    "ect": 117,
    "load": 236,
    "requirement": 337,
    "graduation": 169,
    "minimum": 256,
    "optional": 291,
    "distribution": 103,
    "between": 44,
    "course": 82,
    "transfer": 404,
    "external": 139,
    "thesis": 392,
    "worth": 442,
    "include": 195,
    "list": 235,
    "all": 18,
    "available": 33,
    "show": 360,
    "offer": 283,
    "which": 435,
    "want": 424,
    "know": 219,
    "learning": 228,
    "tell": 383,
    "deep": 95,
    "dl": 105,
    "datum": 92,
    "mining": 257,
    "explain": 138,
    "nlp": 275,
    "interested": 201,
    "vision": 421,
    "reinforcement": 335,
    "learn": 227,
    "game": 158,
    "theory": 390,
    "teach": 379,
    "apply": 24,
    "get": 159,
    "accept": 5,
    "gpa": 167,
    "bachelor": 36,
    "cs": 86,
    "entrance": 127,
    "exam": 132,
    "work": 441,
    "experience": 136,
    "mandatory": 246,
    "document": 107,
    "should": 359,
    "submit": 372,
    "recommendation": 332,
    "letter": 232,
    "interview": 204,
    "process": 317,
    "ielt": 192,
    "toefl": 399,
    "score": 353,
    "without": 440,
    "tech": 382,
    "background": 38,
    "prerequisite": 314,
    "we": 427,
    "access": 6,
    "entry": 128,
    "qualify": 326,
    "condition": 74,
    "must": 265,
    "meet": 254,
    "join": 212,
    "enroll": 125,
    "admission": 9,
    "criterion": 85,
    "eligibility": 121,
    "application": 23,
    "qualification": 325,
    "when": 433,
    "start": 368,
    "any": 22,
    "enter": 126,
    "much": 264,
    "cost": 79,
    "tuition": 406,
    "fee": 145,
    "price": 315,
    "additional": 7,
    "payment": 301,
    "plan": 311,
    "international": 202,
    "student": 370,
    "material": 251,
    "scholarship": 350,
    "discount": 102,
    "early": 114,
    "pay": 300,
    "installment": 197,
    "that": 387,
    "cool": 78,
    "affordable": 11,
    "not": 277,
    "bad": 39,
    "waw": 425,
    "great": 171,
    "reasonable": 330,
    "perfect": 305,
    "thank": 386,
    "value": 419,
    "money": 260,
    "within": 439,
    "budget": 51,
    "fair": 142,
    "happy": 174,
    "oof": 288,
    "expensive": 135,
    "too": 400,
    "ouf": 294,
    "high": 181,
    "way": 426,
    "over": 296,
    "unaffordable": 408,
    "expect": 134,
    "cheap": 65,
    "afford": 10,
    "costly": 80,
    "option": 290,
    "beyond": 45,
    "mean": 253,
    "internship": 203,
    "where": 434,
    "help": 177,
    "find": 147,
    "kind": 218,
    "abroad": 3,
    "unpaid": 411,
    "choose": 66,
    "company": 71,
    "language": 222,
    "english": 124,
    "french": 154,
    "study": 371,
    "if": 193,
    "speak": 366,
    "class": 68,
    "bilingual": 47,
    "write": 443,
    "support": 376,
    "attend": 29,
    "only": 287,
    "primary": 316,
    "laguage": 221,
    "deadline": 94,
    "date": 91,
    "after": 12,
    "close": 69,
    "will": 437,
    "result": 338,
    "late": 224,
    "rolling": 343,
    "next": 272,
    "intake": 199,
    "defer": 96,
    "weekly": 431,
    "schedule": 349,
    "on": 285,
    "weekday": 429,
    "weekend": 430,
    "hour": 187,
    "week": 428,
    "timetable": 396,
    "record": 333,
    "view": 420,
    "attendance": 30,
    "lab": 220,
    "session": 358,
    "lecture": 229,
    "flexible": 150,
    "usually": 417,
    "first": 149,
    "begin": 42,
    "pm": 312,
    "typical": 407,
    "end": 123,
    "lunch": 241,
    "break": 49,
    "back": 37,
    "hold": 183,
    "same": 346,
    "as": 27,
    "look": 240,
    "timing": 397,
    "could": 81,
    "organize": 293,
    "place": 310,
    "give": 160,
    "detail": 100,
    "calender": 56,
    "locate": 237,
    "city": 67,
    "campus": 58,
    "urban": 413,
    "rural": 344,
    "area": 25,
    "housing": 188,
    "near": 270,
    "easy": 116,
    "public": 324,
    "transport": 405,
    "facility": 140,
    "visit": 422,
    "before": 41,
    "exactly": 131,
    "host": 185,
    "main": 244,
    "downtown": 108,
    "north": 276,
    "south": 365,
    "more": 262,
    "than": 385,
    "location": 238,
    "physically": 308,
    "science": 352,
    "satellite": 348,
    "different": 101,
    "address": 8,
    "teaching": 381,
    "build": 52,
    "building": 53,
    "shuttle": 361,
    "service": 357,
    "summary": 374,
    "overview": 297,
    "describe": 99,
    "summarize": 373,
    "curriculum": 88,
    "make": 245,
    "special": 367,
    "key": 216,
    "feature": 144,
    "highlight": 182,
    "focus": 151,
    "topic": 402,
    "education": 119,
    "unique": 409,
    "objective": 280,
    "skill": 362,
    "gain": 157,
    "big": 46,
    "picture": 309,
    "outcome": 295,
    "philosophy": 307,
    "content": 75,
    "provide": 323,
    "everything": 130,
    "up": 412,
    "possible": 313,
    "financial": 146,
    "aid": 15,
    "off": 282,
    "maximum": 252,
    "percent": 303,
    "grant": 170,
    "amount": 19,
    "receive": 331,
    "waiver": 423,
    "top": 401,
    "benefit": 43,
    "from": 155,
    "percentage": 304,
    "package": 298,
    "social": 363,
    "instructor": 198,
    "professor": 319,
    "involve": 206,
    "faculty": 141,
    "member": 255,
    "teacher": 380,
    "lead": 226,
    "expert": 137,
    "deliver": 98,
    "summer": 375,
    "during": 112,
    "vacation": 418,
    "continue": 76,
    "july": 213,
    "and": 21,
    "august": 31,
    "job": 211,
    "opportunity": 289,
    "graduate": 168,
    "career": 60,
    "follow": 152,
    "easily": 115,
    "role": 342,
    "professionally": 318,
    "prospect": 321,
    "then": 389
  },
  "intent": {
    "register_now": 23,
    "inform": 20,
    "bot_challenge": 17,
    "greet": 19,
    "goodbye": 18,
    "ask_duration": 8,
    "ask_semesters": 16,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 22,
    "negative_reaction": 21,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 15,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_summary": 30,
    "utter_ask_semesters": 31,
    "utter_goodbye": 32,
    "utter_greet": 33,
    "utter_happy_response": 34,
    "utter_iamabot": 35
  },
  "action_text": null,
  "intent_response_key": null
}