{
  "text": {
    "register": 338,
    "now": 282,
    "hadi": 177,
    "cheayto": 68,
    "my": 270,
    "name": 271,
    "be": 42,
    "i": 198,
    "aya": 37,
    "ali": 17,
    "mohamad": 261,
    "you": 457,
    "can": 61,
    "call": 59,
    "fatima": 145,
    "khalil": 223,
    "full": 160,
    "jad": 216,
    "nasrallah": 273,
    "it": 214,
    "sara": 355,
    "abi": 2,
    "youne": 458,
    "elie": 123,
    "hanna": 178,
    "go": 166,
    "by": 57,
    "lina": 239,
    "rizk": 347,
    "the": 399,
    "s": 353,
    "omar": 288,
    "daher": 91,
    "ch": 64,
    "__number__": 0,
    "gmail": 165,
    "com": 73,
    "email": 125,
    "at": 30,
    "ay": 36,
    "reach": 332,
    "d": 90,
    "send": 365,
    "info": 203,
    "to": 408,
    "nasr": 272,
    "here": 183,
    "k": 221,
    "hotmail": 192,
    "h": 176,
    "usj": 426,
    "edu": 121,
    "university": 420,
    "drop": 112,
    "rizk23": 348,
    "yahoo": 455,
    "use": 425,
    "m": 246,
    "protonmail": 326,
    "for": 156,
    "school": 360,
    "mariah": 252,
    "j": 215,
    "example": 135,
    "a": 1,
    "bot": 50,
    "human": 196,
    "this": 405,
    "real": 333,
    "person": 309,
    "talk": 389,
    "chat": 65,
    "with": 449,
    "right": 346,
    "an": 21,
    "ai": 15,
    "just": 220,
    "computer": 76,
    "automate": 34,
    "chatbot": 66,
    "who": 447,
    "conversation": 80,
    "alive": 18,
    "intelligent": 207,
    "sound": 373,
    "like": 238,
    "robot": 349,
    "or": 297,
    "machine": 247,
    "think": 404,
    "re": 331,
    "honest": 190,
    "hey": 184,
    "hello": 181,
    "hi": 185,
    "there": 401,
    "good": 167,
    "morning": 266,
    "evening": 131,
    "moin": 262,
    "let": 236,
    "us": 424,
    "dude": 113,
    "goodmorning": 170,
    "goodevene": 169,
    "afternoon": 14,
    "cu": 88,
    "cee": 63,
    "later": 230,
    "night": 278,
    "bye": 58,
    "goodbye": 168,
    "have": 180,
    "nice": 277,
    "day": 94,
    "see": 363,
    "around": 27,
    "how": 195,
    "long": 244,
    "do": 109,
    "master": 253,
    "take": 388,
    "complete": 75,
    "program": 324,
    "what": 442,
    "length": 235,
    "of": 285,
    "duration": 114,
    "degree": 98,
    "year": 456,
    "many": 251,
    "month": 264,
    "last": 228,
    "one": 290,
    "total": 413,
    "time": 406,
    "need": 275,
    "finish": 150,
    "part": 303,
    "in": 201,
    "academic": 5,
    "cover": 84,
    "semester": 364,
    "divide": 107,
    "into": 212,
    "number": 283,
    "term": 395,
    "per": 306,
    "require": 343,
    "summer": 384,
    "include": 202,
    "structure": 378,
    "breakdown": 52,
    "credit": 85,
    "ect": 120,
    "load": 241,
    "requirement": 344,
    "graduation": 173,
    "minimum": 259,
    "optional": 296,
    "distribution": 106,
    "between": 46,
    "course": 83,
    "transfer": 414,
    "external": 141,
    "thesis": 402,
    "worth": 453,
    "list": 240,
    "all": 19,
    "available": 35,
    "show": 369,
    "offer": 287,
    "which": 445,
    "want": 434,
    "know": 225,
    "learning": 233,
    "tell": 394,
    "about": 3,
    "deep": 96,
    "dl": 108,
    "datum": 93,
    "mining": 260,
    "explain": 140,
    "nlp": 279,
    "interested": 208,
    "vision": 431,
    "reinforcement": 339,
    "learn": 232,
    "game": 162,
    "theory": 400,
    "teach": 390,
    "apply": 25,
    "get": 163,
    "accept": 6,
    "gpa": 171,
    "bachelor": 38,
    "cs": 87,
    "entrance": 129,
    "exam": 134,
    "work": 452,
    "experience": 138,
    "mandatory": 250,
    "document": 110,
    "should": 368,
    "submit": 381,
    "recommendation": 336,
    "letter": 237,
    "interview": 211,
    "process": 320,
    "ielt": 199,
    "toefl": 409,
    "score": 362,
    "without": 451,
    "tech": 393,
    "background": 40,
    "prerequisite": 316,
    "we": 437,
    "access": 7,
    "entry": 130,
    "qualify": 330,
    "condition": 77,
    "must": 269,
    "meet": 257,
    "join": 218,
    "enroll": 128,
    "admission": 10,
    "criterion": 86,
    "eligibility": 124,
    "application": 24,
    "qualification": 329,
    "when": 443,
    "start": 377,
    "much": 268,
    "cost": 81,
    "tuition": 416,
    "fee": 147,
    "price": 318,
    "additional": 8,
    "payment": 305,
    "plan": 313,
    "international": 209,
    "student": 379,
    "material": 254,
    "scholarship": 359,
    "discount": 104,
    "early": 117,
    "pay": 304,
    "installment": 204,
    "that": 398,
    "affordable": 12,
    "not": 281,
    "bad": 41,
    "waw": 435,
    "great": 175,
    "reasonable": 334,
    "perfect": 308,
    "thank": 397,
    "value": 429,
    "money": 263,
    "within": 450,
    "budget": 54,
    "fair": 144,
    "happy": 179,
    "oof": 293,
    "expensive": 137,
    "too": 410,
    "ouf": 299,
    "high": 186,
    "way": 436,
    "over": 301,
    "unaffordable": 418,
    "expect": 136,
    "cheap": 67,
    "afford": 11,
    "costly": 82,
    "option": 295,
    "beyond": 47,
    "mean": 256,
    "study": 380,
    "online": 291,
    "hybrid": 197,
    "remote": 341,
    "they": 403,
    "weekend": 440,
    "class": 71,
    "distance": 105,
    "while": 446,
    "after": 13,
    "hour": 193,
    "switch": 386,
    "and": 22,
    "flexibility": 152,
    "scheduling": 358,
    "only": 292,
    "on": 289,
    "campus": 60,
    "present": 317,
    "follow": 155,
    "attend": 31,
    "remotely": 342,
    "possible": 315,
    "from": 159,
    "abroad": 4,
    "home": 189,
    "format": 157,
    "move": 267,
    "lecture": 234,
    "job": 217,
    "design": 101,
    "professional": 321,
    "some": 372,
    "other": 298,
    "relocate": 340,
    "synchronous": 387,
    "asynchronous": 29,
    "support": 385,
    "flexible": 153,
    "internship": 210,
    "where": 444,
    "help": 182,
    "find": 149,
    "kind": 224,
    "unpaid": 421,
    "choose": 69,
    "company": 74,
    "language": 227,
    "english": 127,
    "french": 158,
    "if": 200,
    "speak": 375,
    "bilingual": 49,
    "write": 454,
    "primary": 319,
    "deadline": 95,
    "date": 92,
    "close": 72,
    "will": 448,
    "result": 345,
    "late": 229,
    "rolling": 351,
    "next": 276,
    "intake": 206,
    "defer": 97,
    "weekly": 441,
    "schedule": 357,
    "weekday": 439,
    "week": 438,
    "timetable": 407,
    "record": 337,
    "view": 430,
    "attendance": 32,
    "each": 116,
    "lab": 226,
    "session": 367,
    "usually": 427,
    "first": 151,
    "begin": 44,
    "pm": 314,
    "typical": 417,
    "end": 126,
    "lunch": 245,
    "break": 51,
    "back": 39,
    "hold": 188,
    "same": 354,
    "as": 28,
    "locate": 242,
    "city": 70,
    "urban": 423,
    "rural": 352,
    "area": 26,
    "housing": 194,
    "near": 274,
    "easy": 119,
    "public": 328,
    "transport": 415,
    "facility": 142,
    "visit": 432,
    "before": 43,
    "exactly": 133,
    "host": 191,
    "main": 248,
    "downtown": 111,
    "north": 280,
    "south": 374,
    "more": 265,
    "than": 396,
    "location": 243,
    "physically": 311,
    "science": 361,
    "satellite": 356,
    "different": 103,
    "address": 9,
    "teaching": 392,
    "build": 55,
    "building": 56,
    "shuttle": 370,
    "service": 366,
    "give": 164,
    "summary": 383,
    "overview": 302,
    "describe": 100,
    "summarize": 382,
    "curriculum": 89,
    "make": 249,
    "special": 376,
    "key": 222,
    "feature": 146,
    "highlight": 187,
    "focus": 154,
    "topic": 412,
    "education": 122,
    "unique": 419,
    "brief": 53,
    "objective": 284,
    "skill": 371,
    "gain": 161,
    "big": 48,
    "picture": 312,
    "outcome": 300,
    "philosophy": 310,
    "detail": 102,
    "content": 78,
    "provide": 327,
    "everything": 132,
    "up": 422,
    "financial": 148,
    "aid": 16,
    "off": 286,
    "maximum": 255,
    "percent": 307,
    "grant": 174,
    "amount": 20,
    "receive": 335,
    "waiver": 433,
    "top": 411,
    "benefit": 45,
    "instructor": 205,
    "professor": 323,
    "involve": 213,
    "faculty": 143,
    "member": 258,
    "teacher": 391,
    "lead": 231,
    "expert": 139,
    "deliver": 99,
    "during": 115,
    "any": 23,
    "vacation": 428,
    "continue": 79,
    "july": 219,
    "august": 33,
    "opportunity": 294,
    "graduate": 172,
    "career": 62,
    "easily": 118,
    "role": 350,
    "professionally": 322,
    "prospect": 325
  },
  "intent": {
    "register_now": 24,
    "inform": 21,
    "bot_challenge": 18,
    "greet": 20,
    "goodbye": 19,
    "ask_duration": 8,
    "ask_semesters": 17,
    "ask_credits": 7,
    "ask_courses": 6,
    "ask_course_details": 5,
    "ask_admission": 1,
    "ask_price": 14,
    "positive_reaction": 23,
    "negative_reaction": 22,
    "ask_program_format": 15,
    "ask_internship": 11,
    "ask_language_of_instruction": 13,
    "ask_application_deadlines": 2,
    "ask_class_schedule": 4,
    "ask_campus_location": 3,
    "ask_program_summary": 16,
    "ask_financial_aid_percentage": 9,
    "ask_instructors": 10,
    "ask_about_summer": 0,
    "ask_job_opportunities": 12
  },
  "response": null,
  "action_name": {
    "action_listen": 7,
    "action_restart": 8,
    "action_session_start": 11,
    "action_default_fallback": 5,
    "action_deactivate_loop": 2,
    "action_revert_fallback_events": 9,
    "action_default_ask_affirmation": 3,
    "action_default_ask_rephrase": 4,
    "action_two_stage_fallback": 12,
    "action_unlikely_intent": 13,
    "action_back": 0,
    "action_extract_slots": 6,
    "simple_form": 14,
    "action_course_details": 1,
    "action_say_data": 10,
    "utter_aid_info": 15,
    "utter_ask_about_summer": 16,
    "utter_ask_admission": 17,
    "utter_ask_application_deadlines": 18,
    "utter_ask_campus_location": 19,
    "utter_ask_class_schedule": 20,
    "utter_ask_courses": 21,
    "utter_ask_credits": 22,
    "utter_ask_duration": 23,
    "utter_ask_financial_aid_percentage": 24,
    "utter_ask_instructors": 25,
    "utter_ask_internship": 26,
    "utter_ask_job_opportunities": 27,
    "utter_ask_language_of_instruction": 28,
    "utter_ask_price": 29,
    "utter_ask_program_format": 30,
    "utter_ask_program_summary": 31,
    "utter_ask_semesters": 32,
    "utter_goodbye": 33,
    "utter_greet": 34,
    "utter_happy_response": 35,
    "utter_iamabot": 36
  },
  "action_text": null,
  "intent_response_key": null
}